iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
#include <stdint.h>

struct NVIC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLE_WAKEUP_LP_IRQn:1;
      uint64_t BLE_GEN_IRQn:1;
      uint64_t FTDF_WAKEUP_IRQn:1;
      uint64_t FTDF_GEN_IRQn:1;
      uint64_t RFCAL_IRQn:1;
      uint64_t COEX_IRQn:1;
      uint64_t CRYPTO_IRQn:1;
      uint64_t MRM_IRQn:1;
      uint64_t UART_IRQn:1;
      uint64_t UART2_IRQn:1;
      uint64_t I2C_IRQn:1;
      uint64_t I2C2_IRQn:1;
      uint64_t SPI_IRQn:1;
      uint64_t SPI2_IRQn:1;
      uint64_t ADC_IRQn:1;
      uint64_t KEYBRD_IRQn:1;
      uint64_t IRGEN_IRQn:1;
      uint64_t WKUP_GPIO_IRQn:1;
      uint64_t SWTIM0_IRQn:1;
      uint64_t SWTIM1_IRQn:1;
      uint64_t QUADEC_IRQn:1;
      uint64_t USB_IRQn:1;
      uint64_t PCM_IRQn:1;
      uint64_t SRC_IN_IRQn:1;
      uint64_t SRC_OUT_IRQn:1;
      uint64_t VBUS_IRQn:1;
      uint64_t DMA_IRQn:1;
      uint64_t RF_DIAG_IRQn:1;
      uint64_t TRNG_IRQn:1;
      uint64_t DCDC_IRQn:1;
      uint64_t XTAL16RDY_IRQn:1;
      uint64_t Rsvd__irq__n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISER;

  uint8_t res0[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLE_WAKEUP_LP_IRQn:1;
      uint64_t BLE_GEN_IRQn:1;
      uint64_t FTDF_WAKEUP_IRQn:1;
      uint64_t FTDF_GEN_IRQn:1;
      uint64_t RFCAL_IRQn:1;
      uint64_t COEX_IRQn:1;
      uint64_t CRYPTO_IRQn:1;
      uint64_t MRM_IRQn:1;
      uint64_t UART_IRQn:1;
      uint64_t UART2_IRQn:1;
      uint64_t I2C_IRQn:1;
      uint64_t I2C2_IRQn:1;
      uint64_t SPI_IRQn:1;
      uint64_t SPI2_IRQn:1;
      uint64_t ADC_IRQn:1;
      uint64_t KEYBRD_IRQn:1;
      uint64_t IRGEN_IRQn:1;
      uint64_t WKUP_GPIO_IRQn:1;
      uint64_t SWTIM0_IRQn:1;
      uint64_t SWTIM1_IRQn:1;
      uint64_t QUADEC_IRQn:1;
      uint64_t USB_IRQn:1;
      uint64_t PCM_IRQn:1;
      uint64_t SRC_IN_IRQn:1;
      uint64_t SRC_OUT_IRQn:1;
      uint64_t VBUS_IRQn:1;
      uint64_t DMA_IRQn:1;
      uint64_t RF_DIAG_IRQn:1;
      uint64_t TRNG_IRQn:1;
      uint64_t DCDC_IRQn:1;
      uint64_t XTAL16RDY_IRQn:1;
      uint64_t Rsvd__irq__n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICER;

  uint8_t res1[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLE_WAKEUP_LP_IRQn:1;
      uint64_t BLE_GEN_IRQn:1;
      uint64_t FTDF_WAKEUP_IRQn:1;
      uint64_t FTDF_GEN_IRQn:1;
      uint64_t RFCAL_IRQn:1;
      uint64_t COEX_IRQn:1;
      uint64_t CRYPTO_IRQn:1;
      uint64_t MRM_IRQn:1;
      uint64_t UART_IRQn:1;
      uint64_t UART2_IRQn:1;
      uint64_t I2C_IRQn:1;
      uint64_t I2C2_IRQn:1;
      uint64_t SPI_IRQn:1;
      uint64_t SPI2_IRQn:1;
      uint64_t ADC_IRQn:1;
      uint64_t KEYBRD_IRQn:1;
      uint64_t IRGEN_IRQn:1;
      uint64_t WKUP_GPIO_IRQn:1;
      uint64_t SWTIM0_IRQn:1;
      uint64_t SWTIM1_IRQn:1;
      uint64_t QUADEC_IRQn:1;
      uint64_t USB_IRQn:1;
      uint64_t PCM_IRQn:1;
      uint64_t SRC_IN_IRQn:1;
      uint64_t SRC_OUT_IRQn:1;
      uint64_t VBUS_IRQn:1;
      uint64_t DMA_IRQn:1;
      uint64_t RF_DIAG_IRQn:1;
      uint64_t TRNG_IRQn:1;
      uint64_t DCDC_IRQn:1;
      uint64_t XTAL16RDY_IRQn:1;
      uint64_t Rsvd__irq__n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ISPR;

  uint8_t res2[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLE_WAKEUP_LP_IRQn:1;
      uint64_t BLE_GEN_IRQn:1;
      uint64_t FTDF_WAKEUP_IRQn:1;
      uint64_t FTDF_GEN_IRQn:1;
      uint64_t RFCAL_IRQn:1;
      uint64_t COEX_IRQn:1;
      uint64_t CRYPTO_IRQn:1;
      uint64_t MRM_IRQn:1;
      uint64_t UART_IRQn:1;
      uint64_t UART2_IRQn:1;
      uint64_t I2C_IRQn:1;
      uint64_t I2C2_IRQn:1;
      uint64_t SPI_IRQn:1;
      uint64_t SPI2_IRQn:1;
      uint64_t ADC_IRQn:1;
      uint64_t KEYBRD_IRQn:1;
      uint64_t IRGEN_IRQn:1;
      uint64_t WKUP_GPIO_IRQn:1;
      uint64_t SWTIM0_IRQn:1;
      uint64_t SWTIM1_IRQn:1;
      uint64_t QUADEC_IRQn:1;
      uint64_t USB_IRQn:1;
      uint64_t PCM_IRQn:1;
      uint64_t SRC_IN_IRQn:1;
      uint64_t SRC_OUT_IRQn:1;
      uint64_t VBUS_IRQn:1;
      uint64_t DMA_IRQn:1;
      uint64_t RF_DIAG_IRQn:1;
      uint64_t TRNG_IRQn:1;
      uint64_t DCDC_IRQn:1;
      uint64_t XTAL16RDY_IRQn:1;
      uint64_t Rsvd__irq__n:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICPR;

  uint8_t res3[380];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLE_WAKEUP_LP_IRQn_prio:8;
      uint64_t BLE_GEN_IRQn_prio:8;
      uint64_t FTDF_WAKEUP_IRQn_prio:8;
      uint64_t FTDF_GEN_IRQn_prio:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR0;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RFCAL_IRQn_prio:8;
      uint64_t COEX_IRQn_prio:8;
      uint64_t CRYPTO_IRQn_prio:8;
      uint64_t MRM_IRQn_prio:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UART_IRQn_prio:8;
      uint64_t UART2_IRQn_prio:8;
      uint64_t I2C_IRQn_prio:8;
      uint64_t I2C2_IRQn_prio:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SPI_IRQn_prio:8;
      uint64_t SPI2_IRQn_prio:8;
      uint64_t ADC_IRQn_prio:8;
      uint64_t KEYBRD_IRQn_prio:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t IRGEN_IRQn_prio:8;
      uint64_t WKUP_GPIO_IRQn_prio:8;
      uint64_t SWTIM0_IRQn_prio:8;
      uint64_t SWTIM1_IRQn_prio:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QUADEC_IRQn_prio:8;
      uint64_t USB_IRQn_prio:8;
      uint64_t PCM_IRQn_prio:8;
      uint64_t SRC_IN_IRQn_prio:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_OUT_IRQn_prio:8;
      uint64_t VBUS_IRQn_prio:8;
      uint64_t DMA_IRQn_prio:8;
      uint64_t RF_DIAG_IRQn_prio:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRNG_IRQn_prio:8;
      uint64_t DCDC_IRQn_prio:8;
      uint64_t XTAL16RDY_IRQn_prio:8;
      uint64_t RESERVED31_IRQn_DONT_USE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) IPR7;

