iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define NVIC (*(volatile struct NVIC_tag *) 0xe000e100)

struct SCB_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t REVISION:4;
      uint64_t PARTNO:12;
      uint64_t CONSTANT:4;
      uint64_t VARIANT:4;
      uint64_t IMPLEMENTER:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPUID;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECTACTIVE:6;
      uint64_t reservedSpace0:6;
      uint64_t VECTPENDING:6;
      uint64_t reservedSpace1:4;
      uint64_t ISRPENDING:1;
      uint64_t reservedSpace2:2;
      uint64_t PENDSTCLR:1;
      uint64_t PENDSTSET:1;
      uint64_t PENDSVCLR:1;
      uint64_t PENDSVSET:1;
      uint64_t reservedSpace3:2;
      uint64_t NMIPENDSET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ICSR;

  uint8_t res0[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t VECTRESET:1;
      uint64_t VECTCLRACTIVE:1;
      uint64_t SYSRESETREQ:1;
      uint64_t reservedSpace0:12;
      uint64_t ENDIANESS:1;
      uint64_t VECTKEY:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AIRCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SLEEPONEXIT:1;
      uint64_t SLEEPDEEP:1;
      uint64_t reservedSpace1:1;
      uint64_t SEVEONPEND:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:3;
      uint64_t UNALIGN_TRP:1;
      uint64_t reservedSpace1:5;
      uint64_t STKALIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:24;
      uint64_t PRI_11:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHPR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t PRI_14:8;
      uint64_t PRI_15:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SHPR3;

};

#define SCB (*(volatile struct SCB_tag *) 0xe000ed00)

struct SysTick_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ENABLE:1;
      uint64_t TICKINT:1;
      uint64_t CLKSOURCE:1;
      uint64_t reservedSpace0:13;
      uint64_t COUNTFLAG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CTRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RELOAD:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) LOAD;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) VAL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TENMS:24;
      uint64_t reservedSpace0:6;
      uint64_t SKEW:1;
      uint64_t NOREF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CALIB;

};

#define SysTick (*(volatile struct SysTick_tag *) 0xe000e010)

struct AES_HASH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_ALG:2;
      uint64_t CRYPTO_ALG_MD:2;
      uint64_t CRYPTO_OUT_MD:1;
      uint64_t CRYPTO_AES_KEY_SZ:2;
      uint64_t CRYPTO_ENCDEC:1;
      uint64_t CRYPTO_IRQ_EN:1;
      uint64_t CRYPTO_HASH_SEL:1;
      uint64_t CRYPTO_HASH_OUT_LEN:6;
      uint64_t CRYPTO_MORE_IN:1;
      uint64_t CRYPTO_AES_KEXP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_START_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_FETCH_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_FETCH_ADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_LEN:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_LEN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_DEST_ADDR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_DEST_ADDR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_INACTIVE:1;
      uint64_t CRYPTO_WAIT_FOR_IN:1;
      uint64_t CRYPTO_IRQ_ST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_CLRIRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_CLRIRQ_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_MREG0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_MREG0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_MREG1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_MREG1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_MREG2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_MREG2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_MREG3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_MREG3_REG;

  uint8_t res0[212];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRYPTO_KEY_X:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRYPTO_KEYS_START;

};

#define AES_HASH (*(volatile struct AES_HASH_tag *) 0x40020000)

struct ANAMISC_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t TEST_STRUCTURE:4;
      uint64_t ACORE_TESTBUS_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANA_TEST_REG;

  uint8_t res0[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHARGE_LEVEL:5;
      uint64_t CHARGE_ON:1;
      uint64_t NTC_DISABLE:1;
      uint64_t NTC_LOW_DISABLE:1;
      uint64_t CHARGE_CUR:4;
      uint64_t DIE_TEMP_SET:2;
      uint64_t DIE_TEMP_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHARGER_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CURRENT_GAIN_TRIM:4;
      uint64_t CHARGER_VFLOAT_ADJ:4;
      uint64_t CURRENT_OFFSET_TRIM:5;
      uint64_t CHARGER_TEST:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHARGER_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHARGER_CC_MODE:1;
      uint64_t CHARGER_CV_MODE:1;
      uint64_t END_OF_CHARGE:1;
      uint64_t CHARGER_BATTEMP_LOW:1;
      uint64_t CHARGER_BATTEMP_OK:1;
      uint64_t CHARGER_BATTEMP_HIGH:1;
      uint64_t CHARGER_TMODE_PROT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CHARGER_STATUS_REG;

  uint8_t res1[50];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SOC_ENABLE:1;
      uint64_t SOC_RESET_CHARGE:1;
      uint64_t SOC_RESET_AVG:1;
      uint64_t SOC_MUTE:1;
      uint64_t SOC_GPIO:1;
      uint64_t SOC_SIGN:1;
      uint64_t SOC_IDAC:2;
      uint64_t SOC_LPF:1;
      uint64_t SOC_CLK:3;
      uint64_t SOC_BIAS:2;
      uint64_t SOC_CINT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SOC_RVI:2;
      uint64_t SOC_SCYCLE:3;
      uint64_t SOC_DCYCLE:1;
      uint64_t SOC_ICM:2;
      uint64_t SOC_CHOP:3;
      uint64_t SOC_CMIREG_ENABLE:1;
      uint64_t SOC_MAW:3;
      uint64_t SOC_DYNAVG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SOC_VSAT:2;
      uint64_t SOC_DYNTARG:1;
      uint64_t SOC_DYNHYS:1;
      uint64_t SOC_VCMI:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_CTRL3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SOC_ADD2CH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_ADD2CH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHARGE_CNT1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_CHARGE_CNTR1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHARGE_CNT2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_CHARGE_CNTR2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHARGE_CNT3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_CHARGE_CNTR3_REG;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHARGE_AVG:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_CHARGE_AVG_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SOC_INT_OVERLOAD:1;
      uint64_t SOC_INT_LOCKED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_STATUS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SOC_IDAC_VAL:9;
      uint64_t SOC_IDAC_SIGN:1;
      uint64_t SOC_RDAC_DIS:1;
      uint64_t SOC_NR_SCYCLE:3;
      uint64_t SOC_EXT_SCYCLE_EN:1;
      uint64_t SOC_EXT_IDAC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_EXT_IN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SOC_HIGH_LIM:1;
      uint64_t SOC_LOWLIM_COMP:1;
      uint64_t SOC_POS_COMP:1;
      uint64_t SOC_RISING_COMP:1;
      uint64_t SOC_STATE:4;
      uint64_t SOC_CTRL_EVENT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SOC_EXT_OUT_REG;

