iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res3[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t REF_CLK_SEL:2;
      uint64_t REF_CAL_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_REF_SEL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t REF_CNT_VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_REF_CNT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t XTAL_CNT_VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_REF_VAL_L_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t XTAL_CNT_VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_REF_VAL_H_REG;

};

#define ANAMISC (*(volatile struct ANAMISC_tag *) 0x50001b02)

struct APU_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_EN:1;
      uint64_t SRC_IN_AMODE:1;
      uint64_t SRC_IN_CAL_BYPASS:1;
      uint64_t reservedSpace0:1;
      uint64_t SRC_IN_DS:2;
      uint64_t SRC_IN_OK:1;
      uint64_t SRC_DITHER_DISABLE:1;
      uint64_t reservedSpace1:5;
      uint64_t SRC_OUT_AMODE:1;
      uint64_t SRC_OUT_CAL_BYPASS:1;
      uint64_t reservedSpace2:1;
      uint64_t SRC_OUT_US:2;
      uint64_t SRC_OUT_OK:1;
      uint64_t reservedSpace3:1;
      uint64_t SRC_IN_OVFLOW:1;
      uint64_t SRC_IN_UNFLOW:1;
      uint64_t SRC_OUT_OVFLOW:1;
      uint64_t SRC_OUT_UNFLOW:1;
      uint64_t SRC_IN_FLOWCLR:1;
      uint64_t SRC_OUT_FLOWCLR:1;
      uint64_t reservedSpace4:2;
      uint64_t SRC_PDM_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_IN_FS:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_IN_FS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_OUT_FS:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_OUT_FS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SRC_IN:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_IN1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SRC_IN:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_IN2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SRC_OUT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_OUT1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t SRC_OUT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SRC1_OUT2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC1_MUX_IN:3;
      uint64_t PCM1_MUX_IN:3;
      uint64_t PDM1_MUX_IN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APU_MUX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF0:16;
      uint64_t SRC_COEF1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF10_SET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF2:16;
      uint64_t SRC_COEF3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF32_SET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF4:16;
      uint64_t SRC_COEF5:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF54_SET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF6:16;
      uint64_t SRC_COEF7:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF76_SET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF8:16;
      uint64_t SRC_COEF9:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF98_SET1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SRC_COEF10:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) COEF0A_SET1_REG;

  uint8_t res0[200];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_EN:1;
      uint64_t PCM_MASTER:1;
      uint64_t PCM_FSCLEN:4;
      uint64_t PCM_FSCDEL:1;
      uint64_t PCM_PPOD:1;
      uint64_t PCM_CLKINV:1;
      uint64_t PCM_FSCINV:1;
      uint64_t PCM_CLK_BIT:1;
      uint64_t PCM_CH_DEL:5;
      uint64_t PCM_FSC_EDGE:1;
      uint64_t reservedSpace0:3;
      uint64_t PCM_FSC_DIV:12;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM1_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_IN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM1_IN1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_IN:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM1_IN2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_OUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM1_OUT1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PCM_OUT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PCM1_OUT2_REG;

};

#define APU (*(volatile struct APU_tag *) 0x50004000)

struct BLE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCERR:3;
      uint64_t reservedSpace0:1;
      uint64_t RXWINSZDEF:4;
      uint64_t RWBLE_EN:1;
      uint64_t ADVERTFILT_EN:1;
      uint64_t reservedSpace1:2;
      uint64_t CORR_MODE:2;
      uint64_t reservedSpace2:2;
      uint64_t HOP_REMAP_DSB:1;
      uint64_t CRC_DSB:1;
      uint64_t WHIT_DSB:1;
      uint64_t CRYPT_DSB:1;
      uint64_t NESN_DSB:1;
      uint64_t SN_DSB:1;
      uint64_t MD_DSB:1;
      uint64_t reservedSpace3:1;
      uint64_t SCAN_ABORT:1;
      uint64_t ADVERT_ABORT:1;
      uint64_t RFTEST_ABORT:1;
      uint64_t reservedSpace4:1;
      uint64_t SWINT_REQ:1;
      uint64_t REG_SOFT_RST:1;
      uint64_t MASTER_TGSOFT_RST:1;
      uint64_t MASTER_SOFT_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_RWBLECNTL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUILD:8;
      uint64_t UPG:8;
      uint64_t REL:8;
      uint64_t TYP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_VERSION_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUSWIDTH:1;
      uint64_t USECRYPT:1;
      uint64_t USEDBG:1;
      uint64_t COEX_bitfield:1;
      uint64_t INTMODE:1;
      uint64_t DMMODE:1;
      uint64_t DECIPHER:1;
      uint64_t reservedSpace0:1;
      uint64_t CLK_SEL:6;
      uint64_t reservedSpace1:2;
      uint64_t RFIF:7;
      uint64_t reservedSpace2:1;
      uint64_t ADD_WIDTH:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_RWBLECONF_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSCNTINTMSK:1;
      uint64_t RXINTMSK:1;
      uint64_t SLPINTMSK:1;
      uint64_t EVENTINTMSK:1;
      uint64_t CRYPTINTMSK:1;
      uint64_t ERRORINTMSK:1;
      uint64_t GROSSTGTIMINTMSK:1;
      uint64_t FINETGTIMINTMSK:1;
      uint64_t EVENTAPFAINTMSK:1;
      uint64_t SWINTMSK:1;
      uint64_t reservedSpace0:5;
      uint64_t CSCNTDEVMSK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_INTCNTL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSCNTINTSTAT:1;
      uint64_t RXINTSTAT:1;
      uint64_t SLPINTSTAT:1;
      uint64_t EVENTINTSTAT:1;
      uint64_t CRYPTINTSTAT:1;
      uint64_t ERRORINTSTAT:1;
      uint64_t GROSSTGTIMINTSTAT:1;
      uint64_t FINETGTIMINTSTAT:1;
      uint64_t EVENTAPFAINTSTAT:1;
      uint64_t SWINTSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_INTSTAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSCNTINTRAWSTAT:1;
      uint64_t RXINTRAWSTAT:1;
      uint64_t SLPINTRAWSTAT:1;
      uint64_t EVENTINTRAWSTAT:1;
      uint64_t CRYPTINTRAWSTAT:1;
      uint64_t ERRORINTRAWSTAT:1;
      uint64_t GROSSTGTIMINTRAWSTAT:1;
      uint64_t FINETGTIMINTRAWSTAT:1;
      uint64_t EVENTAPFAINTRAWSTAT:1;
      uint64_t SWINTRAWSTAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_INTRAWSTAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CSCNTINTACK:1;
      uint64_t RXINTACK:1;
      uint64_t SLPINTACK:1;
      uint64_t EVENTINTACK:1;
      uint64_t CRYPTINTACK:1;
      uint64_t ERRORINTACK:1;
      uint64_t GROSSTGTIMINTACK:1;
      uint64_t FINETGTIMINTACK:1;
      uint64_t EVENTAPFAINTACK:1;
      uint64_t SWINTACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_INTACK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASETIMECNT:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_BASETIMECNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FINECNT:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_FINETIMECNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BDADDRL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_BDADDRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BDADDRU:16;
      uint64_t PRIV_NPUB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_BDADDRU_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CURRENTRXDESCPTR:15;
      uint64_t reservedSpace0:1;
      uint64_t ETPTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_CURRENTRXDESCPTR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEEP_SLEEP_IRQ_EN:2;
      uint64_t DEEP_SLEEP_ON:1;
      uint64_t DEEP_SLEEP_CORR_EN:1;
      uint64_t SOFT_WAKEUP_REQ:1;
      uint64_t reservedSpace0:10;
      uint64_t DEEP_SLEEP_STAT:1;
      uint64_t reservedSpace1:15;
      uint64_t EXTWKUPDSB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_DEEPSLCNTL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEEPSLTIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_DEEPSLWKUP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DEEPSLDUR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_DEEPSLSTAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TWIRQ_RESET:10;
      uint64_t TWIRQ_SET:11;
      uint64_t TWEXT:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_ENBPRESET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FINECNTCORR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_FINECNTCORR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BASETIMECNTCORR:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_BASETIMECNTCORR_REG;

