iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIAG0:6;
      uint64_t reservedSpace0:1;
      uint64_t DIAG0_EN:1;
      uint64_t DIAG1:6;
      uint64_t reservedSpace1:1;
      uint64_t DIAG1_EN:1;
      uint64_t DIAG2:6;
      uint64_t reservedSpace2:1;
      uint64_t DIAG2_EN:1;
      uint64_t DIAG3:6;
      uint64_t reservedSpace3:1;
      uint64_t DIAG3_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_DIAGCNTL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIAG0STAT:8;
      uint64_t DIAG1STAT:8;
      uint64_t DIAG2STAT:8;
      uint64_t DIAG3STAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_DIAGSTAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM_ADDMAX:16;
      uint64_t REG_ADDMAX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_DEBUGADDMAX_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EM_ADDMIN:16;
      uint64_t REG_ADDMIN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_DEBUGADDMIN_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXCRYPT_ERROR:1;
      uint64_t RXCRYPT_ERROR:1;
      uint64_t PKTCNTL_EMACC_ERROR:1;
      uint64_t RADIO_EMACC_ERROR:1;
      uint64_t EVT_SCHDL_EMACC_ERROR:1;
      uint64_t EVT_SCHDL_ENTRY_ERROR:1;
      uint64_t EVT_SCHDL_APFM_ERROR:1;
      uint64_t EVT_CNTL_APFM_ERROR:1;
      uint64_t WHITELIST_ERROR:1;
      uint64_t IFS_UNDERRUN:1;
      uint64_t ADV_UNDERRUN:1;
      uint64_t LLCHMAP_ERROR:1;
      uint64_t CSFORMAT_ERROR:1;
      uint64_t TXDESC_EMPTY_ERROR:1;
      uint64_t RXDESC_EMPTY_ERROR:1;
      uint64_t TXDATA_PTR_ERROR:1;
      uint64_t RXDATA_PTR_ERROR:1;
      uint64_t CONCEVTIRQ_ERROR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_ERRORTYPESTAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWPROFVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_SWPROFILING_REG;

  uint8_t res1[8];

  uint32_t BLE_RADIOCNTL0_REG;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:16;
      uint64_t XRFSEL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_RADIOCNTL1_REG;

  uint32_t BLE_RADIOCNTL2_REG;
  uint32_t BLE_RADIOCNTL3_REG;
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPWRUP:8;
      uint64_t TXPWRDN:4;
      uint64_t reservedSpace0:4;
      uint64_t RXPWRUP:8;
      uint64_t RTRIP_DELAY:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_RADIOPWRUPDN_REG;

  uint8_t res2[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADVCHMAP:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_ADVCHMAP_REG;

  uint8_t res3[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ADVINT:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_ADVTIM_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t UPPERLIMIT:9;
      uint64_t reservedSpace0:7;
      uint64_t BACKOFF:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_ACTSCANSTAT_REG;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WLPUBADDPTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_WLPUBADDPTR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WLPRIVADDPTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_WLPRIVADDPTR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NBPUBDEV:8;
      uint64_t NBPRIVDEV:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_WLNBDEV_REG;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AES_START:1;
      uint64_t AES_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_AESCNTL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AESKEY31_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_AESKEY31_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AESKEY63_32:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_AESKEY63_32_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AESKEY95_64:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_AESKEY95_64_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AESKEY127_96:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_AESKEY127_96_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AESPTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_AESPTR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXMICVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_TXMICVAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXMICVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_RXMICVAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXLENGTH:9;
      uint64_t reservedSpace0:2;
      uint64_t TXPKTCNTEN:1;
      uint64_t TXPLDSRC:1;
      uint64_t PRBSTYPE:1;
      uint64_t TXLENGTHSRC:1;
      uint64_t INFINITETX:1;
      uint64_t reservedSpace1:11;
      uint64_t RXPKTCNTEN:1;
      uint64_t reservedSpace2:3;
      uint64_t INFINITERX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_RFTESTCNTL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPKTCNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_RFTESTTXSTAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXPKTCNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_RFTESTRXSTAT_REG;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREFETCH_TIME:9;
      uint64_t reservedSpace0:7;
      uint64_t PREFETCHABORT_TIME:10;
      uint64_t reservedSpace1:5;
      uint64_t APFM_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_TIMGENCNTL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GROSSTARGET:23;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_GROSSTIMTGT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FINETARGET:27;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_FINETIMTGT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SAMP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_SAMPLECLK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t COEX_EN:1;
      uint64_t SYNCGEN_EN:1;
      uint64_t reservedSpace0:2;
      uint64_t WLANRXMSK:2;
      uint64_t WLANTXMSK:2;
      uint64_t reservedSpace1:8;
      uint64_t WLCTXPRIOMODE:2;
      uint64_t reservedSpace2:2;
      uint64_t WLCRXPRIOMODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_COEXIFCNTL0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WLCPDELAY:7;
      uint64_t reservedSpace0:1;
      uint64_t WLCPDURATION:7;
      uint64_t reservedSpace1:1;
      uint64_t WLCPTXTHR:5;
      uint64_t reservedSpace2:3;
      uint64_t WLCPRXTHR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_COEXIFCNTL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLEM0:4;
      uint64_t BLEM1:4;
      uint64_t BLEM2:4;
      uint64_t BLEM3:4;
      uint64_t BLEM4:4;
      uint64_t BLEM5:4;
      uint64_t BLEM6:4;
      uint64_t BLEM7:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_BLEMPRIO0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:28;
      uint64_t BLEMDEFAULT:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_BLEMPRIO1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BLEMARGIN:8;
      uint64_t reservedSpace0:7;
      uint64_t BLEPRIOMODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_BLEPRIOSCHARB_REG;

  uint8_t res7[236];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EMACCERRSTAT:1;
      uint64_t EMACCERRACK:1;
      uint64_t EMACCERRMSK:1;
      uint64_t reservedSpace0:3;
      uint64_t BLE_CLK_STAT:1;
      uint64_t MON_LP_CLK:1;
      uint64_t RADIO_PWRDN_ALLOW:1;
      uint64_t BLE_CLK_SEL:6;
      uint64_t reservedSpace1:4;
      uint64_t SW_RPL_SPI:1;
      uint64_t WAKEUPLPSTAT:1;
      uint64_t BLE_RSSI_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_CNTL2_REG;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:10;
      uint64_t BLE_EM_BASE_16_10:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_EM_BASE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIAG4:6;
      uint64_t reservedSpace0:1;
      uint64_t DIAG4_EN:1;
      uint64_t DIAG5:6;
      uint64_t reservedSpace1:1;
      uint64_t DIAG5_EN:1;
      uint64_t DIAG6:6;
      uint64_t reservedSpace2:1;
      uint64_t DIAG6_EN:1;
      uint64_t DIAG7:6;
      uint64_t reservedSpace3:1;
      uint64_t DIAG7_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_DIAGCNTL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIAG0_BIT:3;
      uint64_t DIAG0_INV:1;
      uint64_t DIAG1_BIT:3;
      uint64_t DIAG1_INV:1;
      uint64_t DIAG2_BIT:3;
      uint64_t DIAG2_INV:1;
      uint64_t DIAG3_BIT:3;
      uint64_t DIAG3_INV:1;
      uint64_t DIAG4_BIT:3;
      uint64_t DIAG4_INV:1;
      uint64_t DIAG5_BIT:3;
      uint64_t DIAG5_INV:1;
      uint64_t DIAG6_BIT:3;
      uint64_t DIAG6_INV:1;
      uint64_t DIAG7_BIT:3;
      uint64_t DIAG7_INV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BLE_DIAGCNTL3_REG;

