iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define BLE (*(volatile struct BLE_tag *) 0x40000000)

struct CACHE_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_FLUSH:1;
      uint64_t CACHE_RES1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_CTRL1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_LINE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_LNSIZECFG_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_ASSOC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_ASSOCCFG_REG;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_LEN:9;
      uint64_t CACHE_WEN:1;
      uint64_t CACHE_CGEN:1;
      uint64_t ENABLE_ALSO_OTP_CACHED:1;
      uint64_t ENABLE_ALSO_QSPIFLASH_CACHED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_CTRL2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CACHE_ASSOCIATIVITY_RESET_VALUE:2;
      uint64_t CACHE_LINE_SIZE_RESET_VALUE:2;
      uint64_t CACHE_RAM_SIZE_RESET_VALUE:3;
      uint64_t CACHE_CONTROLLER_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_CTRL3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_HITS:19;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_HITS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_MISSES:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_MISSES_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_START:1;
      uint64_t MRM_IRQ_MASK:1;
      uint64_t MRM_IRQ_TINT_STATUS:1;
      uint64_t MRM_IRQ_THRES_STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_TINT:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_TINT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MRM_THRES:18;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CACHE_MRM_THRES_REG;

  uint8_t res1[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SWD_HW_RESET_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) SWD_RESET_REG;

};

#define CACHE (*(volatile struct CACHE_tag *) 0x400c3000)

struct CHIP_VERSION_tag
{
  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHIP_ID1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHIP_ID1_REG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHIP_ID2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHIP_ID2_REG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHIP_ID3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHIP_ID3_REG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHIP_SWC:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHIP_SWC_REG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t REVISION_ID:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHIP_REVISION_REG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHIP_CONFIG1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHIP_CONFIG1_REG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHIP_CONFIG2:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHIP_CONFIG2_REG;

  union
  {
    uint8_t R;
    struct
    {
      uint64_t CHIP_CONFIG3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(1))) CHIP_CONFIG3_REG;

  uint8_t res0[2];

  uint8_t CHIP_TEST1_REG;
  uint8_t CHIP_TEST2_REG;
};

#define CHIP_VERSION (*(volatile struct CHIP_VERSION_tag *) 0x50003200)

struct COEX_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t PRGING_ARBITER:1;
      uint64_t reservedSpace0:3;
      uint64_t SMART_ACT_IMPL:1;
      uint64_t SEL_COEX_DIAG:2;
      uint64_t SEL_FTDF_CCA:1;
      uint64_t SEL_FTDF_PTI:1;
      uint64_t reservedSpace1:1;
      uint64_t SEL_BLE_WLAN_TX_RX:1;
      uint64_t SEL_BLE_RADIO_BUSY:2;
      uint64_t IGNORE_EXT:1;
      uint64_t IGNORE_FTDF:1;
      uint64_t IGNORE_BLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_DECISION_PTR:5;
      uint64_t COEX_DECISION:2;
      uint64_t COEX_DECISION_CLOSING:1;
      uint64_t SMART_ACT:1;
      uint64_t SMART_PRI:1;
      uint64_t EXT_ACT0:1;
      uint64_t EXT_ACT1:1;
      uint64_t COEX_RADIO_BUSY:1;
      uint64_t IGNORE_EXT_STAT:1;
      uint64_t IGNORE_FTDF_STAT:1;
      uint64_t IGNORE_BLE_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_STAT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_IRQ_MASK:1;
      uint64_t COEX_IRQ_ON_SMART_ACT_R:1;
      uint64_t COEX_IRQ_ON_SMART_ACT_F:1;
      uint64_t COEX_IRQ_ON_SMART_PRI_R:1;
      uint64_t COEX_IRQ_ON_SMART_PRI_F:1;
      uint64_t COEX_IRQ_ON_EXT_ACT_R:1;
      uint64_t COEX_IRQ_ON_EXT_ACT_F:1;
      uint64_t COEX_IRQ_ON_FTDF_ACTIVE_R:1;
      uint64_t COEX_IRQ_ON_FTDF_ACTIVE_F:1;
      uint64_t COEX_IRQ_ON_BLE_ACTIVE_R:1;
      uint64_t COEX_IRQ_ON_BLE_ACTIVE_F:1;
      uint64_t COEX_IRQ_ON_RADIO_BUSY_R:1;
      uint64_t COEX_IRQ_ON_RADIO_BUSY_F:1;
      uint64_t COEX_IRQ_ON_CLOSING_BRK:1;
      uint64_t COEX_IRQ_ON_START_MID:1;
      uint64_t COEX_IRQ_ON_DECISION_SW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_INT_MASK_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_IRQ_STAT:1;
      uint64_t COEX_IRQ_ON_SMART_ACT_R:1;
      uint64_t COEX_IRQ_ON_SMART_ACT_F:1;
      uint64_t COEX_IRQ_ON_SMART_PRI_R:1;
      uint64_t COEX_IRQ_ON_SMART_PRI_F:1;
      uint64_t COEX_IRQ_ON_EXT_ACT_R:1;
      uint64_t COEX_IRQ_ON_EXT_ACT_F:1;
      uint64_t COEX_IRQ_ON_FTDF_ACTIVE_R:1;
      uint64_t COEX_IRQ_ON_FTDF_ACTIVE_F:1;
      uint64_t COEX_IRQ_ON_BLE_ACTIVE_R:1;
      uint64_t COEX_IRQ_ON_BLE_ACTIVE_F:1;
      uint64_t COEX_IRQ_ON_RADIO_BUSY_R:1;
      uint64_t COEX_IRQ_ON_RADIO_BUSY_F:1;
      uint64_t COEX_IRQ_ON_CLOSING_BRK:1;
      uint64_t COEX_IRQ_ON_START_MID:1;
      uint64_t COEX_IRQ_ON_DECISION_SW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_INT_STAT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_BLE_PTI:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_BLE_PTI_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_FTDF_PTI:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_FTDF_PTI_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_DIAG_MON:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_DIAG_REG;

