iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res0[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI4_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI5_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI6_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI7_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI8_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI9_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI10_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI11_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI12_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI13_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI14_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI15_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI16_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COEX_PRI_PTI:3;
      uint64_t COEX_PRI_MAC:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) COEX_PRI17_REG;

};

#define COEX (*(volatile struct COEX_tag *) 0x50002f00)

struct CRG_PER_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_ENABLE:1;
      uint64_t SPI_ENABLE:1;
      uint64_t I2C_ENABLE:1;
      uint64_t QUAD_ENABLE:1;
      uint64_t IR_CLK_ENABLE:1;
      uint64_t KBSCAN_ENABLE:1;
      uint64_t reservedSpace0:2;
      uint64_t SPI_CLK_SEL:1;
      uint64_t I2C_CLK_SEL:1;
      uint64_t KBSCAN_CLK_SEL:1;
      uint64_t ADC_CLK_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_PER_REG;

  uint8_t res0[58];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PCM_DIV:12;
      uint64_t CLK_PCM_EN:1;
      uint64_t PCM_SRC_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCM_DIV_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PCM_FDIV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PCM_FDIV_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PDM_DIV:8;
      uint64_t CLK_PDM_EN:1;
      uint64_t PDM_MASTER_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PDM_DIV_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRC_DIV:8;
      uint64_t CLK_SRC_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SRC_DIV_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t EH_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) EH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t USBPAD_EN:1;
      uint64_t USBPHY_FORCE_SW1_OFF:1;
      uint64_t USBPHY_FORCE_SW2_ON:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) USBPAD_REG;

};

#define CRG_PER (*(volatile struct CRG_PER_tag *) 0x50001c04)

struct CRG_TOP_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t HCLK_DIV:3;
      uint64_t reservedSpace0:1;
      uint64_t PCLK_DIV:2;
      uint64_t AES_CLK_ENABLE:1;
      uint64_t ECC_CLK_ENABLE:1;
      uint64_t TRNG_CLK_ENABLE:1;
      uint64_t OTP_ENABLE:1;
      uint64_t QSPI_DIV:2;
      uint64_t QSPI_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_AMBA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FINE_ADJ:8;
      uint64_t COARSE_ADJ:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_FREQ_TRIM_REG;

  uint8_t res0[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RFCU_DIV:2;
      uint64_t reservedSpace0:1;
      uint64_t RFCU_ENABLE:1;
      uint64_t BLE_DIV:2;
      uint64_t BLE_LP_RESET:1;
      uint64_t BLE_ENABLE:1;
      uint64_t FTDF_MAC_DIV:2;
      uint64_t reservedSpace1:1;
      uint64_t FTDF_MAC_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_RADIO_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SYS_CLK_SEL:2;
      uint64_t XTAL16M_DISABLE:1;
      uint64_t XTAL32M_MODE:1;
      uint64_t USB_CLK_SRC:1;
      uint64_t PLL_DIV2:1;
      uint64_t DIVN_XTAL32M_MODE:1;
      uint64_t DIVN_SYNC_LEVEL:1;
      uint64_t CLK32K_SOURCE:2;
      uint64_t reservedSpace0:2;
      uint64_t RUNNING_AT_32K:1;
      uint64_t RUNNING_AT_RC16M:1;
      uint64_t RUNNING_AT_XTAL16M:1;
      uint64_t RUNNING_AT_PLL96M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TMR0_DIV:2;
      uint64_t TMR0_ENABLE:1;
      uint64_t TMR0_CLK_SEL:1;
      uint64_t TMR1_DIV:2;
      uint64_t TMR1_ENABLE:1;
      uint64_t TMR1_CLK_SEL:1;
      uint64_t TMR2_DIV:2;
      uint64_t TMR2_ENABLE:1;
      uint64_t TMR2_CLK_SEL:1;
      uint64_t BREATH_ENABLE:1;
      uint64_t WAKEUPCT_ENABLE:1;
      uint64_t P06_TMR1_PWM_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_TMR_REG;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PERIPH_SLEEP:1;
      uint64_t RADIO_SLEEP:1;
      uint64_t BLE_SLEEP:1;
      uint64_t FTDF_SLEEP:1;
      uint64_t reservedSpace0:1;
      uint64_t RESET_ON_WAKEUP:1;
      uint64_t OTP_COPY_DIV:2;
      uint64_t RETAIN_RAM:5;
      uint64_t ENABLE_CLKLESS:1;
      uint64_t RETAIN_CACHE:1;
      uint64_t RETAIN_ECCRAM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PMU_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t REMAP_ADR0:3;
      uint64_t REMAP_RAMS:2;
      uint64_t PAD_LATCH_EN:1;
      uint64_t OTPC_RESET_REQ:1;
      uint64_t DEBUGGER_ENABLE:1;
      uint64_t DRA_OFF:1;
      uint64_t TIMEOUT_DISABLE:1;
      uint64_t CACHERAM_MUX:1;
      uint64_t DEV_PHASE:1;
      uint64_t QSPI_INIT:1;
      uint64_t OTP_COPY:1;
      uint64_t REMAP_INTVECT:1;
      uint64_t SW_RESET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SYS_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RAD_IS_DOWN:1;
      uint64_t RAD_IS_UP:1;
      uint64_t PER_IS_DOWN:1;
      uint64_t PER_IS_UP:1;
      uint64_t reservedSpace0:1;
      uint64_t DBG_IS_ACTIVE:1;
      uint64_t XTAL16_TRIM_READY:1;
      uint64_t reservedSpace1:1;
      uint64_t BLE_IS_DOWN:1;
      uint64_t BLE_IS_UP:1;
      uint64_t FTDF_IS_DOWN:1;
      uint64_t FTDF_IS_UP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SYS_STAT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t XTAL_COUNT_N:6;
      uint64_t XTAL_TRIM_SELECT:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TRIM_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIVN_SYNC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DIVN_SYNC_REG;

  uint8_t res2[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t XTAL32K_ENABLE:1;
      uint64_t XTAL32K_RBIAS:2;
      uint64_t XTAL32K_CUR:4;
      uint64_t RC32K_ENABLE:1;
      uint64_t RC32K_TRIM:4;
      uint64_t XTAL32K_DISABLE_AMPREG:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_32K_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RC16M_ENABLE:1;
      uint64_t RC16M_TRIM:4;
      uint64_t XTAL16_CUR_SET:3;
      uint64_t XTAL16_MAX_CURRENT:1;
      uint64_t XTAL16_EXT_CLK_ENABLE:1;
      uint64_t XTAL16_AMP_TRIM:3;
      uint64_t XTAL16_SPIKE_FLT_BYPASS:1;
      uint64_t XTAL16_HPASS_FLT_EN:1;
      uint64_t RC16M_STARTUP_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_16M_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RCX20K_TRIM:4;
      uint64_t RCX20K_NTC:4;
      uint64_t RCX20K_BIAS:2;
      uint64_t RCX20K_LOWF:1;
      uint64_t RCX20K_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CLK_RCX20K_REG;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BGR_TRIM:5;
      uint64_t BGR_ITRIM:5;
      uint64_t LDO_SLEEP_TRIM:4;
      uint64_t BYPASS_COLD_BOOT_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BANDGAP_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LDO_RADIO_OK:1;
      uint64_t COMP_VBAT_OK:1;
      uint64_t VBUS_AVAILABLE:1;
      uint64_t NEWBAT:1;
      uint64_t LDO_SUPPLY_VBAT_OK:1;
      uint64_t LDO_SUPPLY_USB_OK:1;
      uint64_t BANDGAP_OK:1;
      uint64_t COMP_VDD_HIGH:1;
      uint64_t LDO_CORE_OK:1;
      uint64_t LDO_1V8_PA_OK:1;
      uint64_t LDO_1V8_FLASH_OK:1;
      uint64_t COMP_VBUS_HIGH:1;
      uint64_t COMP_VBUS_LOW:1;
      uint64_t COMP_V33_HIGH:1;
      uint64_t COMP_1V8_FLASH_HIGH:1;
      uint64_t COMP_1V8_PA_HIGH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ANA_STATUS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SU_BANDGAP_OK:1;
      uint64_t SU_VBUS_AVAILABLE:1;
      uint64_t SU_LDO_SUPPLY_VBAT_OK:1;
      uint64_t SU_LOD_SUPPLY_USB_OK:1;
      uint64_t SU_LDO_CORE_OK:1;
      uint64_t SU_LDO_1V8_PA_OK:1;
      uint64_t SU_COMP_VDD_HIGH:1;
      uint64_t SU_COMP_V33_HIGH:1;
      uint64_t SU_COMP_VBUS_HIGH:1;
      uint64_t SU_COMP_VBUS_LOW:1;
      uint64_t SU_COMP_1V8_PA_HIGH:1;
      uint64_t SU_COMP_1V8_FLASH_HIGH:1;
      uint64_t SU_NEWBAT:1;
      uint64_t SU_LDO_1V8_FLASH_OK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) STARTUP_STATUS_REG;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VBUS_IRQ_EN_FALL:1;
      uint64_t VBUS_IRQ_EN_RISE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VBUS_IRQ_MASK_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VBUS_IRQ_CLEAR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) VBUS_IRQ_CLEAR_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BOD_VDD_TRIM:2;
      uint64_t BOD_1V8_FLASH_TRIM:2;
      uint64_t BOD_1V8_PA_TRIM:2;
      uint64_t BOD_V33_TRIM:2;
      uint64_t BOD_VDD_LVL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BOD_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BOD_RESET_EN:1;
      uint64_t BOD_VDD_EN:1;
      uint64_t BOD_V33_EN:1;
      uint64_t BOD_1V8_PA_EN:1;
      uint64_t BOD_1V8_FLASH_EN:1;
      uint64_t BOD_VBAT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BOD_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BOD_VDD_LOW:1;
      uint64_t BOD_1V8_PA_LOW:1;
      uint64_t BOD_1V8_FLASH_LOW:1;
      uint64_t BOD_V33_LOW:1;
      uint64_t BOD_VBAT_LOW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BOD_STATUS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LDO_CORE_CURLIM:2;
      uint64_t LDO_VBAT_RET_LEVEL:2;
      uint64_t LDO_SUPPLY_VBAT_LEVEL:2;
      uint64_t LDO_SUPPLY_USB_LEVEL:2;
      uint64_t LDO_CORE_SETVDD:3;
      uint64_t LDO_RADIO_SETVDD:3;
      uint64_t LDO_RADIO_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) LDO_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LDO_1V2_ON:1;
      uint64_t LDO_3V3_ON:1;
      uint64_t LDO_1V8_FLASH_ON:1;
      uint64_t LDO_1V8_PA_ON:1;
      uint64_t LDO_VBAT_RET_DISABLE:1;
      uint64_t LDO_1V8_FLASH_RET_DISABLE:1;
      uint64_t LDO_1V8_PA_RET_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) LDO_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SLEEP_TIMER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SLEEP_TIMER_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TRIM_NEWBAT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) POWER_CTRL_REG;

  uint8_t res5[14];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t XTALRDY_CNT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) XTALRDY_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t XTALRDY_STAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) XTALRDY_STAT_REG;

  uint8_t res6[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FORCE_FTDF_SLEEP:1;
      uint64_t FORCE_BLE_SLEEP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) FORCE_SLEEP_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LDOS_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) LDOS_DISABLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t OSC16_HOLD_AMP_REG:1;
      uint64_t OSC16_SH_DISABLE:1;
      uint64_t EN_BATSYS_RET:1;
      uint64_t EN_BUSSYS_RET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) AON_SPARE_REG;

