iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define CRG_TOP (*(volatile struct CRG_TOP_tag *) 0x50000000)

struct DCDC_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_MODE:2;
      uint64_t DCDC_FW_ENABLE:1;
      uint64_t DCDC_PRIORITY:8;
      uint64_t DCDC_IDLE_CLK_DIV:2;
      uint64_t DCDC_BROWNOUT_LV_MODE:1;
      uint64_t DCDC_FAST_STARTUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_CTRL_0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_TIMEOUT:5;
      uint64_t DCDC_GLOBAL_MAX_IDLE_TIME:6;
      uint64_t DCDC_STARTUP_DELAY:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_CTRL_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_HSGND_TRIM:3;
      uint64_t DCDC_LSSUP_TRIM:3;
      uint64_t DCDC_TUNE:2;
      uint64_t DCDC_TIMEOUT_IRQ_RES:4;
      uint64_t DCDC_TIMEOUT_IRQ_TRIG:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_CTRL_2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V14_CUR_LIM_MIN:5;
      uint64_t DCDC_V14_CUR_LIM_MAX_HV:5;
      uint64_t DCDC_V14_VOLTAGE:5;
      uint64_t DCDC_V14_FAST_RAMPING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_V14_0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V14_IDLE_MIN:5;
      uint64_t DCDC_V14_IDLE_HYST:5;
      uint64_t DCDC_V14_CUR_LIM_MAX_LV:4;
      uint64_t DCDC_V14_ENABLE_LV:1;
      uint64_t DCDC_V14_ENABLE_HV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_V14_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V18_CUR_LIM_MIN:5;
      uint64_t DCDC_V18_CUR_LIM_MAX_HV:5;
      uint64_t DCDC_V18_VOLTAGE:5;
      uint64_t DCDC_V18_FAST_RAMPING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_V18_0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V18_IDLE_MIN:5;
      uint64_t DCDC_V18_IDLE_HYST:5;
      uint64_t DCDC_V18_CUR_LIM_MAX_LV:4;
      uint64_t DCDC_V18_ENABLE_LV:1;
      uint64_t DCDC_V18_ENABLE_HV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_V18_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_VDD_CUR_LIM_MIN:5;
      uint64_t DCDC_VDD_CUR_LIM_MAX_HV:5;
      uint64_t DCDC_VDD_VOLTAGE:5;
      uint64_t DCDC_VDD_FAST_RAMPING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_VDD_0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_VDD_IDLE_MIN:5;
      uint64_t DCDC_VDD_IDLE_HYST:5;
      uint64_t DCDC_VDD_CUR_LIM_MAX_LV:4;
      uint64_t DCDC_VDD_ENABLE_LV:1;
      uint64_t DCDC_VDD_ENABLE_HV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_VDD_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V18P_CUR_LIM_MIN:5;
      uint64_t DCDC_V18P_CUR_LIM_MAX_HV:5;
      uint64_t DCDC_V18P_VOLTAGE:5;
      uint64_t DCDC_V18P_FAST_RAMPING:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_V18P_0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V18P_IDLE_MIN:5;
      uint64_t DCDC_V18P_IDLE_HYST:5;
      uint64_t DCDC_V18P_CUR_LIM_MAX_LV:4;
      uint64_t DCDC_V18P_ENABLE_LV:1;
      uint64_t DCDC_V18P_ENABLE_HV:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_V18P_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_VDD_CUR_LIM_RET:5;
      uint64_t DCDC_VDD_RET_CYCLES:3;
      uint64_t DCDC_V18P_CUR_LIM_RET:5;
      uint64_t DCDC_V18P_RET_CYCLES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_RET_0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V14_CUR_LIM_RET:5;
      uint64_t DCDC_V14_RET_CYCLES:3;
      uint64_t DCDC_V18_CUR_LIM_RET:5;
      uint64_t DCDC_V18_RET_CYCLES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_RET_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_N_COMP_TRIM:6;
      uint64_t DCDC_N_COMP_MAN_TRIM:1;
      uint64_t DCDC_P_COMP_TRIM:6;
      uint64_t DCDC_P_COMP_MAN_TRIM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_TRIM_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_FORCE_PSW:1;
      uint64_t DCDC_FORCE_NSW:1;
      uint64_t DCDC_FORCE_FW:1;
      uint64_t DCDC_FORCE_V14:1;
      uint64_t DCDC_FORCE_V18:1;
      uint64_t DCDC_FORCE_VDD:1;
      uint64_t DCDC_FORCE_V18P:1;
      uint64_t DCDC_FORCE_IDLE:1;
      uint64_t DCDC_ANA_TEST:3;
      uint64_t DCDC_OUTPUT_MONITOR:3;
      uint64_t DCDC_FORCE_CURRENT:1;
      uint64_t DCDC_FORCE_COMP_CLK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_TEST_0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_TEST_REG:4;
      uint64_t DCDC_TEST_CURRENT:5;
      uint64_t DCDC_COMP_CLK:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_TEST_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_CHARGE_REG_0:3;
      uint64_t DCDC_CHARGE_REG_1:3;
      uint64_t DCDC_CHARGE_REG_2:3;
      uint64_t DCDC_CHARGE_REG_3:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_STATUS_0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V14_NOK:1;
      uint64_t DCDC_V18_NOK:1;
      uint64_t DCDC_VDD_NOK:1;
      uint64_t DCDC_V18P_NOK:1;
      uint64_t DCDC_V14_OK:1;
      uint64_t DCDC_V18_OK:1;
      uint64_t DCDC_VDD_OK:1;
      uint64_t DCDC_V18P_OK:1;
      uint64_t DCDC_V14_AVAILABLE:1;
      uint64_t DCDC_V18_AVAILABLE:1;
      uint64_t DCDC_VDD_AVAILABLE:1;
      uint64_t DCDC_V18P_AVAILABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_STATUS_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_N_COMP:1;
      uint64_t DCDC_P_COMP:1;
      uint64_t DCDC_N_COMP_N:1;
      uint64_t DCDC_N_COMP_P:1;
      uint64_t DCDC_P_COMP_N:1;
      uint64_t DCDC_P_COMP_P:1;
      uint64_t DCDC_PSW_STATE:1;
      uint64_t DCDC_NSW_STATE:1;
      uint64_t DCDC_V14_SW_STATE:1;
      uint64_t DCDC_V18_SW_STATE:1;
      uint64_t DCDC_VDD_SW_STATE:1;
      uint64_t DCDC_V18P_SW_STATE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_STATUS_2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_I_LIM_VDD:5;
      uint64_t DCDC_I_LIM_V18P:5;
      uint64_t DCDC_LV_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_STATUS_3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_I_LIM_V14:5;
      uint64_t DCDC_I_LIM_V18:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_STATUS_4_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V14_TRIM_N:6;
      uint64_t DCDC_V14_TRIM_P:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_TRIM_0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V18_TRIM_N:6;
      uint64_t DCDC_V18_TRIM_P:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_TRIM_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_VDD_TRIM_N:6;
      uint64_t DCDC_VDD_TRIM_P:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_TRIM_2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V18P_TRIM_N:6;
      uint64_t DCDC_V18P_TRIM_P:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_TRIM_3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V14_TIMEOUT_IRQ_STATUS:1;
      uint64_t DCDC_V18_TIMEOUT_IRQ_STATUS:1;
      uint64_t DCDC_VDD_TIMEOUT_IRQ_STATUS:1;
      uint64_t DCDC_V18P_TIMEOUT_IRQ_STATUS:1;
      uint64_t DCDC_BROWN_OUT_IRQ_STATUS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_IRQ_STATUS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V14_TIMEOUT_IRQ_CLEAR:1;
      uint64_t DCDC_V18_TIMEOUT_IRQ_CLEAR:1;
      uint64_t DCDC_VDD_TIMEOUT_IRQ_CLEAR:1;
      uint64_t DCDC_V18P_TIMEOUT_IRQ_CLEAR:1;
      uint64_t DCDC_BROWN_OUT_IRQ_CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_IRQ_CLEAR_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCDC_V14_TIMEOUT_IRQ_MASK:1;
      uint64_t DCDC_V18_TIMEOUT_IRQ_MASK:1;
      uint64_t DCDC_VDD_TIMEOUT_IRQ_MASK:1;
      uint64_t DCDC_V18P_TIMEOUT_IRQ_MASK:1;
      uint64_t DCDC_BROWN_OUT_IRQ_MASK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DCDC_IRQ_MASK_REG;

