iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define DCDC (*(volatile struct DCDC_tag *) 0x50000082)

struct DEM_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t RXDATA_INV:1;
      uint64_t DEM_HSI_POL:1;
      uint64_t MATCH0101_TH:4;
      uint64_t EQUAL_EN:1;
      uint64_t BLE_DDC_EN:1;
      uint64_t IQCORR_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DEM_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VGA2_GAIN0:3;
      uint64_t VGA1_GAIN0:3;
      uint64_t LNA_GAIN0:2;
      uint64_t VGA2_GAIN1:3;
      uint64_t VGA1_GAIN1:3;
      uint64_t LNA_GAIN1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_AGC_LUT_01_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VGA2_GAIN2:3;
      uint64_t VGA1_GAIN2:3;
      uint64_t LNA_GAIN2:2;
      uint64_t VGA2_GAIN3:3;
      uint64_t VGA1_GAIN3:3;
      uint64_t LNA_GAIN3:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_AGC_LUT_23_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VGA2_GAIN4:3;
      uint64_t VGA1_GAIN4:3;
      uint64_t LNA_GAIN4:2;
      uint64_t VGA2_GAIN5:3;
      uint64_t VGA1_GAIN5:3;
      uint64_t LNA_GAIN5:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_AGC_LUT_45_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VGA2_GAIN6:3;
      uint64_t VGA1_GAIN6:3;
      uint64_t LNA_GAIN6:2;
      uint64_t VGA2_GAIN7:3;
      uint64_t VGA1_GAIN7:3;
      uint64_t LNA_GAIN7:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_AGC_LUT_67_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VGA2_GAIN8:3;
      uint64_t VGA1_GAIN8:3;
      uint64_t LNA_GAIN8:2;
      uint64_t VGA2_GAIN9:3;
      uint64_t VGA1_GAIN9:3;
      uint64_t LNA_GAIN9:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_AGC_LUT_89_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AGC_TH_LOW:7;
      uint64_t AGC_TH_HIGH:7;
      uint64_t AGC_MODE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_AGC_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RSSI_TH:6;
      uint64_t EN_FRZ_GAIN:1;
      uint64_t AGCSETTING_SEL:1;
      uint64_t AGCSETTING_WR:4;
      uint64_t SLOW_AGC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_AGC_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AFC_MODE:4;
      uint64_t POLE1:2;
      uint64_t POLE2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_AFC_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCOFFSET_I_WR:8;
      uint64_t DCOFFSET_Q_WR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DC_OFFSET_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCOFFSET_SEL:1;
      uint64_t DCPARCAL_EN:1;
      uint64_t DCPOLE:2;
      uint64_t DCNSTEP:3;
      uint64_t DCNGAIN:2;
      uint64_t DCPARCAL_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DC_OFFSET_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCBETA_I:8;
      uint64_t DCBETA_Q:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DC_OFFSET_CTRL3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCAGCSETTING_FULL0:4;
      uint64_t DCAGCSETTING_FULL1:4;
      uint64_t DCAGCSETTING_FULL2:4;
      uint64_t DCAGCSETTING_FULL3:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DC_OFFSET_CTRL4_REG;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t AFC_RD:8;
      uint64_t AGCSETTING_RD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_AGC_RESULT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RSSI_PH_RD:6;
      uint64_t RSSI_AVG_RD:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_RSSI_RESULT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DCOFFSET_I_RD:8;
      uint64_t DCOFFSET_Q_RD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DC_OFFSET_RESULT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RSSI_COMP01:4;
      uint64_t RSSI_COMP10:4;
      uint64_t RSSI_COMP11:4;
      uint64_t RSSI_COMP00:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_RSSI_COMP_CTRL_REG;

  uint8_t res1[12];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CFE_BIAS:10;
      uint64_t CFE_MODE:2;
      uint64_t CFE_NSTEP:2;
      uint64_t CHSEL_FILT_MODE2:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FTDF_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CORRTH:6;
      uint64_t NORM_EN:1;
      uint64_t PD_MODE:1;
      uint64_t PD_NPEAK:3;
      uint64_t PD_NWIN:3;
      uint64_t PD_OFFSET:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FTDF_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIF:9;
      uint64_t FTDF_DDC_EN:1;
      uint64_t MATCH_FILT_EN:1;
      uint64_t TIMING_CORR_EN:1;
      uint64_t CHSEL_FILT_MODE1:2;
      uint64_t DS_OFFSET:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FTDF_CTRL3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SFD0:4;
      uint64_t SFD1:4;
      uint64_t LQI_PREAMBLE_EN:1;
      uint64_t LQI_SYMBOL_EN:1;
      uint64_t LQI_CORRTH_EN:1;
      uint64_t LQI_SCALE:2;
      uint64_t FTDF_HSI_POL:1;
      uint64_t CCA_MODE:1;
      uint64_t SO_FTDF_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FTDF_CTRL4_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KP_LF_PD:8;
      uint64_t KI_LF_PD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FTDF_LOOP_GAIN_PD_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KP_LF_DS:8;
      uint64_t KI_LF_DS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FTDF_LOOP_GAIN_DS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RSSITH:13;
      uint64_t FTDF_DDC_INV:1;
      uint64_t FSSS_CLEAR:1;
      uint64_t DS_OFFSET_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FTDF_CTRL5_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COBI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FTDF_COBI_LOW_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COBI:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FTDF_COBI_HIGH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DEM_TESTMODE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DEM_TESTMODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IQCORR_BETA:8;
      uint64_t IQCORR_ALPHA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DEM_IQCORRECT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PAD_POS_LIMIT:7;
      uint64_t PAD_NEG_LIMIT:7;
      uint64_t PAD_CLEAR_COUNT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_PAD_CNT_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PAD_POS_CNT_RD:8;
      uint64_t PAD_NEG_CNT_RD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_PAD_CNT_RESULT_REG;

  uint8_t res2[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSSS_I_RD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FSSS_I_RESULT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSSS_Q_RD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FSSS_Q_RESULT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FSSS_MAG_RD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FSSS_MAG_RESULT_REG;

