iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define DEM (*(volatile struct DEM_tag *) 0x50002e00)

struct DMA_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA0_A_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA0_A_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA0_A_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA0_A_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA0_B_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA0_B_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA0_B_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA0_B_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA0_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA0_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA0_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA0_LEN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t IRQ_ENABLE:1;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA0_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA0_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA0_IDX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA1_A_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA1_A_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA1_A_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA1_A_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA1_B_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA1_B_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA1_B_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA1_B_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA1_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA1_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA1_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA1_LEN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t IRQ_ENABLE:1;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA1_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA1_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA1_IDX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA2_A_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA2_A_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA2_A_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA2_A_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA2_B_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA2_B_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA2_B_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA2_B_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA2_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA2_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA2_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA2_LEN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t IRQ_ENABLE:1;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA2_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA2_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA2_IDX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA3_A_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA3_A_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA3_A_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA3_A_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA3_B_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA3_B_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA3_B_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA3_B_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA3_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA3_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA3_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA3_LEN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t IRQ_ENABLE:1;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA3_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA3_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA3_IDX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA4_A_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA4_A_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA4_A_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA4_A_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA4_B_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA4_B_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA4_B_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA4_B_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA4_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA4_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA4_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA4_LEN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t IRQ_ENABLE:1;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA4_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA4_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA4_IDX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA5_A_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA5_A_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA5_A_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA5_A_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA5_B_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA5_B_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA5_B_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA5_B_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA5_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA5_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA5_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA5_LEN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t IRQ_ENABLE:1;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA5_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA5_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA5_IDX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA6_A_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA6_A_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA6_A_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA6_A_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA6_B_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA6_B_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA6_B_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA6_B_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA6_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA6_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA6_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA6_LEN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t IRQ_ENABLE:1;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA6_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA6_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA6_IDX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA7_A_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA7_A_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA7_A_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA7_A_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA7_B_STARTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA7_B_STARTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA7_B_STARTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA7_B_STARTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA7_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA7_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA7_LEN:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA7_LEN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA_ON:1;
      uint64_t BW:2;
      uint64_t IRQ_ENABLE:1;
      uint64_t DREQ_MODE:1;
      uint64_t BINC:1;
      uint64_t AINC:1;
      uint64_t CIRCULAR:1;
      uint64_t DMA_PRIO:3;
      uint64_t DMA_IDLE:1;
      uint64_t DMA_INIT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA7_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA7_IDX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA7_IDX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA01_SEL:4;
      uint64_t DMA23_SEL:4;
      uint64_t DMA45_SEL:4;
      uint64_t DMA67_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA_REQ_MUX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA_IRQ_CH0:1;
      uint64_t DMA_IRQ_CH1:1;
      uint64_t DMA_IRQ_CH2:1;
      uint64_t DMA_IRQ_CH3:1;
      uint64_t DMA_IRQ_CH4:1;
      uint64_t DMA_IRQ_CH5:1;
      uint64_t DMA_IRQ_CH6:1;
      uint64_t DMA_IRQ_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA_INT_STATUS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMA_RST_IRQ_CH0:1;
      uint64_t DMA_RST_IRQ_CH1:1;
      uint64_t DMA_RST_IRQ_CH2:1;
      uint64_t DMA_RST_IRQ_CH3:1;
      uint64_t DMA_RST_IRQ_CH4:1;
      uint64_t DMA_RST_IRQ_CH5:1;
      uint64_t DMA_RST_IRQ_CH6:1;
      uint64_t DMA_RST_IRQ_CH7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DMA_CLEAR_INT_REG;

