iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define DMA (*(volatile struct DMA_tag *) 0x50003500)

struct ECC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_OpPtrA:5;
      uint64_t reservedSpace0:3;
      uint64_t ECC_OpPtrB:5;
      uint64_t reservedSpace1:3;
      uint64_t ECC_OpPtrC:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_CONFIG_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_TypeOperation:7;
      uint64_t ECC_Field:1;
      uint64_t ECC_SizeOfOperands:8;
      uint64_t reservedSpace0:13;
      uint64_t ECC_SignA:1;
      uint64_t ECC_SignB:1;
      uint64_t ECC_CalcR2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_COMMAND_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_Start:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_CONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_Fail_Address:4;
      uint64_t ECC_Point_Px_NotOnCurve:1;
      uint64_t ECC_Point_Px_AtInfinity:1;
      uint64_t ECC_Couple_NotValid:1;
      uint64_t ECC_Param_n_NotValid:1;
      uint64_t reservedSpace0:1;
      uint64_t ECC_Signature_NotValid:1;
      uint64_t ECC_Param_AB_NotValid:1;
      uint64_t ECC_NotInvertible:1;
      uint64_t ECC_PrimalityTestResult:1;
      uint64_t reservedSpace1:3;
      uint64_t ECC_Busy:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ECC_SVN:8;
      uint64_t ECC_HVN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ECC_VERSION_REG;

};

#define ECC (*(volatile struct ECC_tag *) 0x50006000)

struct FTDF_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FIFO_0_0_REG;

  uint8_t res0[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FIFO_1_0_REG;

  uint8_t res1[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FIFO_2_0_REG;

  uint8_t res2[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FIFO_3_0_REG;

  uint8_t res3[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_LENGTH:7;
      uint64_t PHYATTR_DEM_PTI:4;
      uint64_t PHYATTR_CN:4;
      uint64_t PHYATTR_CALCAP:4;
      uint64_t PHYATTR_RF_GPIO_PINS:3;
      uint64_t PHYATTR_HSI:1;
      uint64_t FRAMETYPE:3;
      uint64_t CSMACA_ENA:1;
      uint64_t reservedSpace0:1;
      uint64_t ACKREQUEST:1;
      uint64_t reservedSpace1:1;
      uint64_t CRC16_ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_META_DATA_0_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACSN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_META_DATA_1_0_REG;

  uint8_t res4[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_LENGTH:7;
      uint64_t PHYATTR_DEM_PTI:4;
      uint64_t PHYATTR_CN:4;
      uint64_t PHYATTR_CALCAP:4;
      uint64_t PHYATTR_RF_GPIO_PINS:3;
      uint64_t PHYATTR_HSI:1;
      uint64_t FRAMETYPE:3;
      uint64_t CSMACA_ENA:1;
      uint64_t reservedSpace0:1;
      uint64_t ACKREQUEST:1;
      uint64_t reservedSpace1:1;
      uint64_t CRC16_ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_META_DATA_0_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACSN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_META_DATA_1_1_REG;

  uint8_t res5[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_LENGTH:7;
      uint64_t PHYATTR_DEM_PTI:4;
      uint64_t PHYATTR_CN:4;
      uint64_t PHYATTR_CALCAP:4;
      uint64_t PHYATTR_RF_GPIO_PINS:3;
      uint64_t PHYATTR_HSI:1;
      uint64_t FRAMETYPE:3;
      uint64_t CSMACA_ENA:1;
      uint64_t reservedSpace0:1;
      uint64_t ACKREQUEST:1;
      uint64_t reservedSpace1:1;
      uint64_t CRC16_ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_META_DATA_0_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACSN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_META_DATA_1_2_REG;

  uint8_t res6[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FRAME_LENGTH:7;
      uint64_t PHYATTR_DEM_PTI:4;
      uint64_t PHYATTR_CN:4;
      uint64_t PHYATTR_CALCAP:4;
      uint64_t PHYATTR_RF_GPIO_PINS:3;
      uint64_t PHYATTR_HSI:1;
      uint64_t FRAMETYPE:3;
      uint64_t CSMACA_ENA:1;
      uint64_t reservedSpace0:1;
      uint64_t ACKREQUEST:1;
      uint64_t reservedSpace1:1;
      uint64_t CRC16_ENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_META_DATA_0_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACSN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_META_DATA_1_3_REG;

  uint8_t res7[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXTIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_RETURN_STATUS_0_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKFAIL:1;
      uint64_t CSMACAFAIL:1;
      uint64_t CSMACANRRETRIES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_RETURN_STATUS_1_0_REG;

  uint8_t res8[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXTIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_RETURN_STATUS_0_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKFAIL:1;
      uint64_t CSMACAFAIL:1;
      uint64_t CSMACANRRETRIES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_RETURN_STATUS_1_1_REG;

  uint8_t res9[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXTIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_RETURN_STATUS_0_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKFAIL:1;
      uint64_t CSMACAFAIL:1;
      uint64_t CSMACANRRETRIES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_RETURN_STATUS_1_2_REG;

  uint8_t res10[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXTIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_RETURN_STATUS_0_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACKFAIL:1;
      uint64_t CSMACAFAIL:1;
      uint64_t CSMACANRRETRIES:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_RETURN_STATUS_1_3_REG;

  uint8_t res11[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_TIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_0_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC16_ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t RES_FRM_TYPE_ERROR:1;
      uint64_t RES_FRM_VERSION_ERROR:1;
      uint64_t DPANID_ERROR:1;
      uint64_t DADDR_ERROR:1;
      uint64_t SPANID_ERROR:1;
      uint64_t ISPANID_COORD_ERROR:1;
      uint64_t QUALITY_INDICATOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_1_0_REG;

  uint8_t res12[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_TIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_0_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC16_ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t RES_FRM_TYPE_ERROR:1;
      uint64_t RES_FRM_VERSION_ERROR:1;
      uint64_t DPANID_ERROR:1;
      uint64_t DADDR_ERROR:1;
      uint64_t SPANID_ERROR:1;
      uint64_t ISPANID_COORD_ERROR:1;
      uint64_t QUALITY_INDICATOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_1_1_REG;

  uint8_t res13[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_TIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_0_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC16_ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t RES_FRM_TYPE_ERROR:1;
      uint64_t RES_FRM_VERSION_ERROR:1;
      uint64_t DPANID_ERROR:1;
      uint64_t DADDR_ERROR:1;
      uint64_t SPANID_ERROR:1;
      uint64_t ISPANID_COORD_ERROR:1;
      uint64_t QUALITY_INDICATOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_1_2_REG;

  uint8_t res14[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_TIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_0_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC16_ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t RES_FRM_TYPE_ERROR:1;
      uint64_t RES_FRM_VERSION_ERROR:1;
      uint64_t DPANID_ERROR:1;
      uint64_t DADDR_ERROR:1;
      uint64_t SPANID_ERROR:1;
      uint64_t ISPANID_COORD_ERROR:1;
      uint64_t QUALITY_INDICATOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_1_3_REG;

  uint8_t res15[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_TIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_0_4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC16_ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t RES_FRM_TYPE_ERROR:1;
      uint64_t RES_FRM_VERSION_ERROR:1;
      uint64_t DPANID_ERROR:1;
      uint64_t DADDR_ERROR:1;
      uint64_t SPANID_ERROR:1;
      uint64_t ISPANID_COORD_ERROR:1;
      uint64_t QUALITY_INDICATOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_1_4_REG;

  uint8_t res16[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_TIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_0_5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC16_ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t RES_FRM_TYPE_ERROR:1;
      uint64_t RES_FRM_VERSION_ERROR:1;
      uint64_t DPANID_ERROR:1;
      uint64_t DADDR_ERROR:1;
      uint64_t SPANID_ERROR:1;
      uint64_t ISPANID_COORD_ERROR:1;
      uint64_t QUALITY_INDICATOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_1_5_REG;

  uint8_t res17[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_TIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_0_6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC16_ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t RES_FRM_TYPE_ERROR:1;
      uint64_t RES_FRM_VERSION_ERROR:1;
      uint64_t DPANID_ERROR:1;
      uint64_t DADDR_ERROR:1;
      uint64_t SPANID_ERROR:1;
      uint64_t ISPANID_COORD_ERROR:1;
      uint64_t QUALITY_INDICATOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_1_6_REG;

  uint8_t res18[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_TIMESTAMP:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_0_7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CRC16_ERROR:1;
      uint64_t reservedSpace0:1;
      uint64_t RES_FRM_TYPE_ERROR:1;
      uint64_t RES_FRM_VERSION_ERROR:1;
      uint64_t DPANID_ERROR:1;
      uint64_t DADDR_ERROR:1;
      uint64_t SPANID_ERROR:1;
      uint64_t ISPANID_COORD_ERROR:1;
      uint64_t QUALITY_INDICATOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_META_1_7_REG;

  uint8_t res19[32008];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_FIFO_0_0_REG;

  uint8_t res20[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_FIFO_1_0_REG;

  uint8_t res21[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_FIFO_2_0_REG;

  uint8_t res22[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_FIFO_3_0_REG;

  uint8_t res23[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_FIFO_4_0_REG;

  uint8_t res24[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_FIFO_5_0_REG;

  uint8_t res25[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_FIFO_6_0_REG;

