iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res26[124];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_FIFO:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_FIFO_7_0_REG;

  uint8_t res27[31868];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REL_NAME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_REL_NAME_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REL_NAME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_REL_NAME_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REL_NAME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_REL_NAME_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t REL_NAME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_REL_NAME_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUILDTIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_BUILDTIME_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUILDTIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_BUILDTIME_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUILDTIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_BUILDTIME_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t BUILDTIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_BUILDTIME_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t ISPANCOORDINATOR:1;
      uint64_t RX_DMA_REQ:1;
      uint64_t TX_DMA_REQ:1;
      uint64_t reservedSpace1:4;
      uint64_t MACSIMPLEADDRESS:8;
      uint64_t reservedSpace2:1;
      uint64_t MACLEENABLED:1;
      uint64_t MACTSCHENABLED:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_GLOB_CONTROL_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACPANID:16;
      uint64_t MACSHORTADDRESS:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_GLOB_CONTROL_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AEXTENDEDADDRESS_L:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_GLOB_CONTROL_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t AEXTENDEDADDRESS_H:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_GLOB_CONTROL_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t RXONDURATION:24;
      uint64_t RXALWAYSON:1;
      uint64_t reservedSpace1:1;
      uint64_t PTI:4;
      uint64_t KEEP_PHY_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXPIPEPROPDELAY:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TXPIPEPROPDELAY_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACACKWAITDURATION:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_MACACKWAITDURATION_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACENHACKWAITDURATION:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_MACENHACKWAITDURATION_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHYRXATTR_DEM_PTI:4;
      uint64_t PHYRXATTR_CN:4;
      uint64_t PHYRXATTR_CALCAP:4;
      uint64_t PHYRXATTR_RF_GPIO_PINS:3;
      uint64_t PHYRXATTR_HSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDSCANENABLE:1;
      uint64_t reservedSpace0:7;
      uint64_t EDSCANDURATION:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACMAXFRAMETOTALWAITTIME:16;
      uint64_t CCAIDLEWAIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_3_REG;

  uint8_t res28[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t GETGENERATORVAL:1;
      uint64_t RXENABLE:1;
      uint64_t SINGLECCA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_OS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t LMACREADY4SLEEP:1;
      uint64_t CCASTAT:1;
      uint64_t reservedSpace1:3;
      uint64_t WAKEUPTIMERENABLESTATUS:1;
      uint64_t reservedSpace2:1;
      uint64_t EDSCANVALUE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EVENTCURRVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_EVENTCURRVAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMESTAMPCURRVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TIMESTAMPCURRVAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHYSLEEPWAIT:8;
      uint64_t RXPIPEPROPDELAY:8;
      uint64_t PHYACKATTR_DEM_PTI:4;
      uint64_t PHYACKATTR_CN:4;
      uint64_t PHYACKATTR_CALCAP:4;
      uint64_t PHYACKATTR_RF_GPIO_PINS:3;
      uint64_t PHYACKATTR_HSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_4_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ACK_RESPONSE_DELAY:8;
      uint64_t CCASTATWAIT:4;
      uint64_t reservedSpace0:4;
      uint64_t PHYCSMACAATTR_DEM_PTI:4;
      uint64_t PHYCSMACAATTR_CN:4;
      uint64_t PHYCSMACAATTR_CALCAP:4;
      uint64_t PHYCSMACAATTR_RF_GPIO_PINS:3;
      uint64_t PHYCSMACAATTR_HSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_5_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LIFSPERIOD:8;
      uint64_t SIFSPERIOD:8;
      uint64_t WUIFSPERIOD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_6_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACRXTOTALCYCLETIME:16;
      uint64_t MACDISCARXOFFTORZ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_11_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t LMACREADY4SLEEP_D:1;
      uint64_t SYNCTIMESTAMP_E:1;
      uint64_t SYMBOLTIMETHR_E:1;
      uint64_t SYMBOLTIME2THR_E:1;
      uint64_t GETGENERATORVAL_E:1;
      uint64_t WAKEUPTIMERENABLESTATUS_D:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_DELTA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIMESTAMPCURRPHASEVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TIMESTAMPCURRPHASEVAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACTSTXACKDELAYVAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_MACTSTXACKDELAYVAL_REG;

