iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res29[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t LMACREADY4SLEEP_M:1;
      uint64_t SYNCTIMESTAMP_M:1;
      uint64_t SYMBOLTIMETHR_M:1;
      uint64_t SYMBOLTIME2THR_M:1;
      uint64_t GETGENERATORVAL_M:1;
      uint64_t WAKEUPTIMERENABLESTATUS_M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_MASK_REG;

  uint8_t res30[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDSCANREADY_E:1;
      uint64_t CCASTAT_E:1;
      uint64_t RXTIMEREXPIRED_E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_EVENT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EDSCANREADY_M:1;
      uint64_t CCASTAT_M:1;
      uint64_t RXTIMEREXPIRED_M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_MASK_REG;

  uint8_t res31[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMAC_MANUAL_MODE:1;
      uint64_t LMAC_MANUAL_PHY_EN:1;
      uint64_t LMAC_MANUAL_TX_EN:1;
      uint64_t LMAC_MANUAL_RX_EN:1;
      uint64_t LMAC_MANUAL_RX_PIPE_EN:1;
      uint64_t LMAC_MANUAL_ED_REQUEST:1;
      uint64_t LMAC_MANUAL_TX_FRM_NR:2;
      uint64_t LMAC_MANUAL_PTI:4;
      uint64_t reservedSpace0:4;
      uint64_t LMAC_MANUAL_PHY_ATTR_DEM_PTI:4;
      uint64_t LMAC_MANUAL_PHY_ATTR_CN:4;
      uint64_t LMAC_MANUAL_PHY_ATTR_CALCAP:4;
      uint64_t LMAC_MANUAL_PHY_ATTR_RF_GPIO_PINS:3;
      uint64_t LMAC_MANUAL_PHY_ATTR_HSI:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_MANUAL_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMAC_MANUAL_TX_START:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_MANUAL_OS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMAC_MANUAL_CCA_STAT:1;
      uint64_t reservedSpace0:7;
      uint64_t LMAC_MANUAL_ED_STAT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_MANUAL_STATUS_REG;

  uint8_t res32[84];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACWUPERIOD:16;
      uint64_t MACCSLSAMPLEPERIOD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_7_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACCSLSTARTSAMPLETIME:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_8_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACCSLDATAPERIOD:16;
      uint64_t MACCSLFRAMEPENDINGWAITT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_9_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACWURZCORRECTION:8;
      uint64_t reservedSpace0:8;
      uint64_t MACCSLMARGINRZ:4;
      uint64_t reservedSpace1:8;
      uint64_t MACRZZEROVAL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMAC_CONTROL_10_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SECTXRXN:1;
      uint64_t reservedSpace1:6;
      uint64_t SECENTRY:4;
      uint64_t reservedSpace2:4;
      uint64_t SECALENGTH:7;
      uint64_t reservedSpace3:1;
      uint64_t SECMLENGTH:7;
      uint64_t SECENCDECN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECURITY_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECAUTHFLAGS:8;
      uint64_t SECENCRFLAGS:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECURITY_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECKEY_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECKEY_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECKEY_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECKEY_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECKEY_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECKEY_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECKEY_3:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECKEY_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECNONCE_0:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECNONCE_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECNONCE_1:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECNONCE_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECNONCE_2:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECNONCE_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECNONCE_3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECNONCE_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECABORT:1;
      uint64_t SECSTART:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECURITY_OS_REG;

  uint8_t res33[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECBUSY:1;
      uint64_t SECAUTHFAIL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECURITY_STATUS_REG;

  uint8_t res34[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECREADY_E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECURITY_EVENT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECREADY_M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SECURITY_EVENTMASK_REG;

  uint8_t res35[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACTSTXACKDELAY:16;
      uint64_t MACTSRXWAIT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TSCH_CONTROL_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACTSRXTX:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TSCH_CONTROL_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACTSRXACKDELAY:16;
      uint64_t MACTSACKWAIT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TSCH_CONTROL_2_REG;

  uint8_t res36[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXBITPOS_0:3;
      uint64_t reservedSpace0:1;
      uint64_t RXBITPOS_1:3;
      uint64_t reservedSpace1:1;
      uint64_t RXBITPOS_2:3;
      uint64_t reservedSpace2:1;
      uint64_t RXBITPOS_3:3;
      uint64_t reservedSpace3:1;
      uint64_t RXBITPOS_4:3;
      uint64_t reservedSpace4:1;
      uint64_t RXBITPOS_5:3;
      uint64_t reservedSpace5:1;
      uint64_t RXBITPOS_6:3;
      uint64_t reservedSpace6:1;
      uint64_t RXBITPOS_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_PHY_PARAMETERS_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBITPOS_0:3;
      uint64_t reservedSpace0:1;
      uint64_t TXBITPOS_1:3;
      uint64_t reservedSpace1:1;
      uint64_t TXBITPOS_2:3;
      uint64_t reservedSpace2:1;
      uint64_t TXBITPOS_3:3;
      uint64_t reservedSpace3:1;
      uint64_t TXBITPOS_4:3;
      uint64_t reservedSpace4:1;
      uint64_t TXBITPOS_5:3;
      uint64_t reservedSpace5:1;
      uint64_t TXBITPOS_6:3;
      uint64_t reservedSpace6:1;
      uint64_t TXBITPOS_7:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_PHY_PARAMETERS_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHYTXSTARTUP:8;
      uint64_t PHYTXLATENCY:8;
      uint64_t PHYTXFINISH:8;
      uint64_t PHYTRXWAIT:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_PHY_PARAMETERS_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PHYRXSTARTUP:8;
      uint64_t PHYRXLATENCY:8;
      uint64_t PHYENABLE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_PHY_PARAMETERS_3_REG;

  uint8_t res37[112];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBGRXTRANSPARENTMODE:1;
      uint64_t RXBEACONONLY:1;
      uint64_t RXCOORDREALIGNONLY:1;
      uint64_t RX_READ_BUF_PTR:4;
      uint64_t DISRXFRMPENDINGCA:1;
      uint64_t DISRXACKREQUESTCA:1;
      uint64_t MACALWAYSPASSCRCERROR:1;
      uint64_t DISDATAREQUESTCA:1;
      uint64_t MACALWAYSPASSRESFRAMEVERSION:1;
      uint64_t MACALWAYSPASSWRONGDPANID:1;
      uint64_t MACALWAYSPASSWRONGDADDR:1;
      uint64_t MACALWAYSPASSBEACONWRONGPANID:1;
      uint64_t MACALWAYSPASSTOPANCOORDINATOR:1;
      uint64_t MACALWAYSPASSFRMTYPE:8;
      uint64_t MACALWAYSPASSWAKEUP:1;
      uint64_t MACPASSWAKEUP:1;
      uint64_t MACIMPLICITBROADCAST:1;
      uint64_t DISRXACKRECEIVEDCA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_CONTROL_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSOF_E:1;
      uint64_t RX_OVERFLOW_E:1;
      uint64_t RX_BUF_AVAIL_E:1;
      uint64_t RXBYTE_E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_EVENT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RXSOF_M:1;
      uint64_t RX_OVERFLOW_M:1;
      uint64_t RX_BUF_AVAIL_M:1;
      uint64_t RXBYTE_M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_MASK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_BUFF_IS_FULL:1;
      uint64_t RX_WRITE_BUF_PTR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYMBOLTIMESNAPSHOTVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SYMBOLTIMESNAPSHOTVAL_REG;

  uint8_t res38[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_BUFF_IS_FULL_D:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_STATUS_DELTA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t RX_BUFF_IS_FULL_M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_RX_STATUS_MASK_REG;

  uint8_t res39[24];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DBGTXTRANSPARENTMODE:1;
      uint64_t reservedSpace0:3;
      uint64_t MACMAXBE:4;
      uint64_t MACMINBE:4;
      uint64_t MACMAXCSMABACKOFFS:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_CONTROL_0_REG;

