iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res40[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTDF_CE:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_FTDF_CE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FTDF_CM:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_FTDF_CM_REG;

  uint8_t res41[172];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCTIMESTAMPTHR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SYNCTIMESTAMPTHR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCTIMESTAMPVAL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SYNCTIMESTAMPVAL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t SYNCTIMESTAMPENA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TIMER_CONTROL_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACTXSTDACKFRMCNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_MACTXSTDACKFRMCNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACRXSTDACKFRMOKCNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_MACRXSTDACKFRMOKCNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACRXADDRFAILFRMCNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_MACRXADDRFAILFRMCNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACRXUNSUPFRMCNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_MACRXUNSUPFRMCNT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYNCTIMESTAMPPHASEVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SYNCTIMESTAMPPHASEVAL_REG;

  uint8_t res42[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MACFCSERRORCOUNT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_MACFCSERRORCOUNT_REG;

  uint8_t res43[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LMACRESET_CONTROL:1;
      uint64_t LMACRESET_RX:1;
      uint64_t LMACRESET_TX:1;
      uint64_t LMACRESET_AHB:1;
      uint64_t LMACRESET_OREG:1;
      uint64_t reservedSpace0:1;
      uint64_t LMACRESET_TSTIM:1;
      uint64_t LMACRESET_SEC:1;
      uint64_t reservedSpace1:1;
      uint64_t LMACRESET_COUNT:1;
      uint64_t LMACRESET_TIMCTRL:1;
      uint64_t reservedSpace2:5;
      uint64_t LMACGLOBRESET_COUNT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_LMACRESET_REG;

  uint8_t res44[28];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYMBOLTIMETHR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SYMBOLTIMETHR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYMBOLTIME2THR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_SYMBOLTIME2THR_REG;

  uint8_t res45[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:8;
      uint64_t DBG_RX_INPUT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_DEBUGCONTROL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBYTE_E:1;
      uint64_t TX_LAST_SYMBOL_E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TXBYTE_E_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TXBYTE_M:1;
      uint64_t TX_LAST_SYMBOL_M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TXBYTE_M_REG;

  uint8_t res46[100];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_S_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_CLEAR_E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_CLEAR_E_0_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_CLEAR_M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_CLEAR_M_0_REG;

  uint8_t res47[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_PRIORITY:4;
      uint64_t ISWAKEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_PRIORITY_0_REG;

  uint8_t res48[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_S_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_CLEAR_E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_CLEAR_E_1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_CLEAR_M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_CLEAR_M_1_REG;

  uint8_t res49[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_PRIORITY:4;
      uint64_t ISWAKEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_PRIORITY_1_REG;

  uint8_t res50[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_S_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_CLEAR_E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_CLEAR_E_2_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_CLEAR_M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_CLEAR_M_2_REG;

  uint8_t res51[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_PRIORITY:4;
      uint64_t ISWAKEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_PRIORITY_2_REG;

  uint8_t res52[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_STAT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_S_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_CLEAR_E:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_CLEAR_E_3_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_CLEAR_M:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_FLAG_CLEAR_M_3_REG;

  uint8_t res53[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_PRIORITY:4;
      uint64_t ISWAKEUP:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_PRIORITY_3_REG;

  uint8_t res54[12];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_SET:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_SET_OS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TX_FLAG_CLEAR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_TX_CLEAR_OS_REG;

