iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res55[2936];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUPINTTHR:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_WAKEUPINTTHR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t WAKEUPTIMERENABLE:1;
      uint64_t WAKEUPENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FTDF_WAKEUP_CONTROL_REG;

};

#define FTDF (*(volatile struct FTDF_tag *) 0x40080000)

struct GP_TIMERS_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t TIM0_CTRL:1;
      uint64_t TIM0_CLK_SEL:1;
      uint64_t TIM0_CLK_DIV:1;
      uint64_t PWM_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TIMER0_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TIM0_ON:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TIMER0_ON_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TIM0_M:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TIMER0_RELOAD_M_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TIM0_N:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TIMER0_RELOAD_N_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START_CYCLE:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PWM2_START_CYCLE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START_CYCLE:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PWM3_START_CYCLE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t START_CYCLE:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PWM4_START_CYCLE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t END_CYCLE:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PWM2_END_CYCLE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t END_CYCLE:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PWM3_END_CYCLE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t END_CYCLE:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PWM4_END_CYCLE;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FREQ:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TRIPLE_PWM_FREQUENCY;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TRIPLE_PWM_ENABLE:1;
      uint64_t SW_PAUSE_EN:1;
      uint64_t HW_PAUSE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TRIPLE_PWM_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BRTH_DIV:8;
      uint64_t BRTH_STEP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BREATH_CFG_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BRTH_DUTY_MAX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BREATH_DUTY_MAX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BRTH_DUTY_MIN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BREATH_DUTY_MIN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BRTH_EN:1;
      uint64_t BRTH_PWM_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BREATH_CTRL_REG;

};

#define GP_TIMERS (*(volatile struct GP_TIMERS_tag *) 0x50003400)

struct GPADC_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t GP_ADC_EN:1;
      uint64_t GP_ADC_START:1;
      uint64_t GP_ADC_CONT:1;
      uint64_t GP_ADC_CLK_SEL:1;
      uint64_t GP_ADC_INT:1;
      uint64_t GP_ADC_MINT:1;
      uint64_t GP_ADC_SE:1;
      uint64_t GP_ADC_MUTE:1;
      uint64_t GP_ADC_SEL:5;
      uint64_t GP_ADC_SIGN:1;
      uint64_t GP_ADC_CHOP:1;
      uint64_t GP_ADC_LDO_ZERO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) GP_ADC_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GP_ADC_ATTN3X:1;
      uint64_t GP_ADC_IDYN:1;
      uint64_t GP_ADC_I20U:1;
      uint64_t GP_ADC_DMA_EN:1;
      uint64_t reservedSpace0:1;
      uint64_t GP_ADC_CONV_NRS:3;
      uint64_t GP_ADC_SMPL_TIME:4;
      uint64_t GP_ADC_STORE_DEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) GP_ADC_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GP_ADC_EN_DEL:8;
      uint64_t GP_ADC_INTERVAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) GP_ADC_CTRL3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GP_ADC_OFFP:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) GP_ADC_OFFP_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GP_ADC_OFFN:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) GP_ADC_OFFN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GP_ADC_CLR_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) GP_ADC_CLEAR_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GP_ADC_VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) GP_ADC_RESULT_REG;

};

#define GPADC (*(volatile struct GPADC_tag *) 0x50001900)

struct GPIO_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t P0_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P0_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P1_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P1_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P2_DATA:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P2_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P3_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P3_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P4_DATA:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P4_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P0_SET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P0_SET_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P1_SET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P1_SET_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P2_SET:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P2_SET_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P3_SET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P3_SET_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P4_SET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P4_SET_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P0_RESET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P0_RESET_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P1_RESET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P1_RESET_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P2_RESET:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P2_RESET_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P3_RESET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P3_RESET_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P4_RESET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P4_RESET_DATA_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P00_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P01_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P02_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P03_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P04_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P05_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P06_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P07_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P10_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P11_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P12_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P13_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P14_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P15_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P16_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P17_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P20_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P21_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P22_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P23_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P24_MODE_REG;

  uint8_t res0[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P30_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P31_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P32_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P33_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P34_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P35_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P36_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P37_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P40_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P41_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P42_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P43_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P44_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P45_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P46_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PID:6;
      uint64_t reservedSpace0:2;
      uint64_t PUPD:2;
      uint64_t PPOD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P47_MODE_REG;

