iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res1[82];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:6;
      uint64_t P0_OUT_CTRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P0_PADPWR_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P1_OUT_CTRL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P1_PADPWR_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P2_OUT_CTRL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P2_PADPWR_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P3_OUT_CTRL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P3_PADPWR_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t P4_OUT_CTRL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) P4_PADPWR_CTRL_REG;

  uint8_t res2[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FUNC_CLOCK_SEL:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) GPIO_CLK_SEL;

  uint8_t res3[14];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RAM_BIST_CONFIG:2;
      uint64_t RAM_BIST_PATTERN:2;
      uint64_t ROMBIST_ENABLE:1;
      uint64_t RAMBIST_ENABLE:1;
      uint64_t SYSRAMBIST_ENABLE:1;
      uint64_t SHOW_BIST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) BIST_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SYSRAM_BIST_LINE_FAIL:1;
      uint64_t SYSRAM_BIST_FAIL:1;
      uint64_t SYSRAM_BIST_BUSY:1;
      uint64_t CTRAM_BIST_LINE_FAIL:1;
      uint64_t CTRAM_BIST_FAIL:1;
      uint64_t CTRAM_BIST_BUSY:1;
      uint64_t CDRAM_BIST_LINE_FAIL:1;
      uint64_t CDRAM_BIST_FAIL:1;
      uint64_t CDRAM_BIST_BUSY:1;
      uint64_t USBRAM_BIST_LINE_FAIL:1;
      uint64_t USBRAM_BIST_FAIL:1;
      uint64_t USBRAM_BIST_BUSY:1;
      uint64_t QSPIRAM_BIST_LINE_FAIL:1;
      uint64_t QSPIRAM_BIST_FAIL:1;
      uint64_t QSPIRAM_BIST_BUSY:1;
      uint64_t ROM_BIST_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RAMBIST_STATUS1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FTDF_TXRAM_BIST_LINE_FAIL:1;
      uint64_t FTDF_TXRAM_BIST_FAIL:1;
      uint64_t FTDF_TXRAM_BIST_BUSY:1;
      uint64_t FTDF_RXRAM_BIST_LINE_FAIL:1;
      uint64_t FTDF_RXRAM_BIST_FAIL:1;
      uint64_t FTDF_RXRAM_BIST_BUSY:1;
      uint64_t ECC_CODERAM_BIST_LINE_FAIL:1;
      uint64_t ECC_CODERAM_BIST_FAIL:1;
      uint64_t ECC_CODERAM_BIST_BUSY:1;
      uint64_t ECC_TCMRAM_BIST_LINE_FAIL:1;
      uint64_t ECC_TCMRAM_BIST_FAIL:1;
      uint64_t ECC_TCMRAM_BIST_BUSY:1;
      uint64_t CRYPTORAM_BIST_LINE_FAIL:1;
      uint64_t CRYPTORAM_BIST_FAIL:1;
      uint64_t CRYPTORAM_BIST_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RAMBIST_STATUS2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ROMBIST_RESULTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ROMBIST_RESULTL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ROMBIST_RESULTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ROMBIST_RESULTH_REG;

  uint8_t res4[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SHOW_CLOCKS:1;
      uint64_t ENABLE_RFPT:1;
      uint64_t SHOW_PLL_TEST_OUT:1;
      uint64_t SHOW_DCDC_TESTBUS:1;
      uint64_t XTAL16M_CAP_TEST_EN:1;
      uint64_t SHOW_IF_RO:1;
      uint64_t PLL_TST_MODE:1;
      uint64_t SHOW_TXDAC_MOD:1;
      uint64_t SHOW_PWR_TST_OUT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TEST_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ANA_TESTMUX_CTRL:4;
      uint64_t reservedSpace0:4;
      uint64_t RF_IN_TESTMUX_CTRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TEST_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RF_TEST_OUT_SEL:6;
      uint64_t USBCOMP_TEST:1;
      uint64_t reservedSpace0:1;
      uint64_t RF_TEST_OUT_PARAM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TEST_CTRL3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RF_TEST_IN_SEL:3;
      uint64_t reservedSpace0:5;
      uint64_t RF_TEST_IN_PARAM:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TEST_CTRL4_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TEST_BUS_TO_AVS:1;
      uint64_t TEST_LDO_1V4:1;
      uint64_t TEST_LDO_1V8_FLASH:1;
      uint64_t TEST_LDO_CORE:1;
      uint64_t TEST_LDO_1V8_PA:1;
      uint64_t TEST_LDO_ADC:1;
      uint64_t TEST_LDO_PLL:1;
      uint64_t TEST_BANDGAP_I_TEST:1;
      uint64_t TEST_SIMO_BUCK:1;
      uint64_t TEST_BOD_VREF_OUT:1;
      uint64_t TEST_BOD_VREF_IN:1;
      uint64_t TEST_I_DCDC_FILT:1;
      uint64_t TEST_VCONT_A:1;
      uint64_t TEST_VREF_1V2_A:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) TEST_CTRL5_REG;

};

#define GPIO (*(volatile struct GPIO_tag *) 0x50003000)

struct GPREG_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t FRZ_WKUPTIM:1;
      uint64_t FRZ_SWTIM0:1;
      uint64_t FRZ_BLETIM:1;
      uint64_t FRZ_WDOG:1;
      uint64_t FRZ_USB:1;
      uint64_t FRZ_DMA:1;
      uint64_t FRZ_SWTIM1:1;
      uint64_t FRZ_SWTIM2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SET_FREEZE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FRZ_WKUPTIM:1;
      uint64_t FRZ_SWTIM0:1;
      uint64_t FRZ_BLETIM:1;
      uint64_t FRZ_WDOG:1;
      uint64_t FRZ_USB:1;
      uint64_t FRZ_DMA:1;
      uint64_t FRZ_SWTIM1:1;
      uint64_t FRZ_SWTIM2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RESET_FREEZE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DEBUGS_FREEZE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) DEBUG_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAL_PHASE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) GP_STATUS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t BLE_WAKEUP_REQ:1;
      uint64_t BLE_H2H_BRIDGE_BYPASS:1;
      uint64_t BLE_WAKEUP_LP_IRQ:1;
      uint64_t reservedSpace0:5;
      uint64_t BLE_DEEPSLDUR_MONITOR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) GP_CONTROL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ECC_BASE_ADDR:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) ECC_BASE_ADDR_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LED1_SRC_SEL:1;
      uint64_t LED2_SRC_SEL:1;
      uint64_t LED3_SRC_SEL:1;
      uint64_t LED1_EN:1;
      uint64_t LED2_EN:1;
      uint64_t LED3_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) LED_CONTROL_REG;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLL_EN:1;
      uint64_t LDO_PLL_ENABLE:1;
      uint64_t LDO_PLL_VREF_HOLD:1;
      uint64_t reservedSpace0:5;
      uint64_t PLL_R_DIV:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLL_SYS_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLL_N_DIV:7;
      uint64_t reservedSpace0:5;
      uint64_t PLL_DEL_SEL:2;
      uint64_t PLL_SEL_MIN_CUR_INT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLL_SYS_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLL_ICP_SEL:5;
      uint64_t reservedSpace0:5;
      uint64_t PLL_START_DEL:5;
      uint64_t PLL_RECALIB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLL_SYS_CTRL3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLL_LOCK_FINE:1;
      uint64_t LDO_PLL_OK:1;
      uint64_t reservedSpace0:3;
      uint64_t PLL_PLL_BEST_MIN_CUR:6;
      uint64_t PLL_CALIBR_END:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLL_SYS_STATUS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t PLL_DIS_LOOPFILT:1;
      uint64_t PLL_MIN_CURRENT:6;
      uint64_t PLL_TEST_VCTR:1;
      uint64_t PLL_OPEN_LOOP:1;
      uint64_t PLL_CHANGE:1;
      uint64_t PLL_SEL_N_DIV_TEST:1;
      uint64_t PLL_SEL_R_DIV_TEST:1;
      uint64_t reservedSpace0:1;
      uint64_t PLL_LOCK_DET_RES_CNT:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) PLL_SYS_TEST_REG;

