iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res37[82];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP_PARAM1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C_COMP_PARAM1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP_PARAM2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C_COMP_PARAM2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP_VERSION:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C_COMP_VERSION_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP2_VERSION:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C_COMP2_VERSION;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP_TYPE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C_COMP_TYPE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP2_TYPE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C_COMP_TYPE2_REG;

};

#define I2C (*(volatile struct I2C_tag *) 0x50001400)

struct I2C2_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t I2C_MASTER_MODE:1;
      uint64_t I2C_SPEED:2;
      uint64_t I2C_10BITADDR_SLAVE:1;
      uint64_t I2C_10BITADDR_MASTER:1;
      uint64_t I2C_RESTART_EN:1;
      uint64_t I2C_SLAVE_DISABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CON_REG;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_TAR:10;
      uint64_t GC_OR_START:1;
      uint64_t SPECIAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_TAR_REG;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_SAR:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_SAR_REG;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IIC_HS_MAR:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_HS_MADDR_REG;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DAT:8;
      uint64_t CMD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_DATA_CMD_REG;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_SS_SCL_HCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_SS_SCL_HCNT_REG;

  uint8_t res5[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_SS_SCL_LCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_SS_SCL_LCNT_REG;

  uint8_t res6[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_FS_SCL_HCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_FS_SCL_HCNT_REG;

  uint8_t res7[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_FS_SCL_LCNT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_FS_SCL_LCNT_REG;

  uint8_t res8[10];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t R_RX_UNDER:1;
      uint64_t R_RX_OVER:1;
      uint64_t R_RX_FULL:1;
      uint64_t R_TX_OVER:1;
      uint64_t R_TX_EMPTY:1;
      uint64_t R_RD_REQ:1;
      uint64_t R_TX_ABRT:1;
      uint64_t R_RX_DONE:1;
      uint64_t R_ACTIVITY:1;
      uint64_t R_STOP_DET:1;
      uint64_t R_START_DET:1;
      uint64_t R_GEN_CALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_INTR_STAT_REG;

  uint8_t res9[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t M_RX_UNDER:1;
      uint64_t M_RX_OVER:1;
      uint64_t M_RX_FULL:1;
      uint64_t M_TX_OVER:1;
      uint64_t M_TX_EMPTY:1;
      uint64_t M_RD_REQ:1;
      uint64_t M_TX_ABRT:1;
      uint64_t M_RX_DONE:1;
      uint64_t M_ACTIVITY:1;
      uint64_t M_STOP_DET:1;
      uint64_t M_START_DET:1;
      uint64_t M_GEN_CALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_INTR_MASK_REG;

  uint8_t res10[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RX_UNDER:1;
      uint64_t RX_OVER:1;
      uint64_t RX_FULL:1;
      uint64_t TX_OVER:1;
      uint64_t TX_EMPTY:1;
      uint64_t RD_REQ:1;
      uint64_t TX_ABRT:1;
      uint64_t RX_DONE:1;
      uint64_t ACTIVITY:1;
      uint64_t STOP_DET:1;
      uint64_t START_DET:1;
      uint64_t GEN_CALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_RAW_INTR_STAT_REG;

  uint8_t res11[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RX_TL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_RX_TL_REG;

  uint8_t res12[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RX_TL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_TX_TL_REG;

  uint8_t res13[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_INTR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_INTR_REG;

  uint8_t res14[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_RX_UNDER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_RX_UNDER_REG;

  uint8_t res15[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_RX_OVER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_RX_OVER_REG;

  uint8_t res16[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_TX_OVER:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_TX_OVER_REG;

  uint8_t res17[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_RD_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_RD_REQ_REG;

  uint8_t res18[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_TX_ABRT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_TX_ABRT_REG;

  uint8_t res19[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_RX_DONE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_RX_DONE_REG;

  uint8_t res20[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_ACTIVITY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_ACTIVITY_REG;

  uint8_t res21[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_ACTIVITY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_STOP_DET_REG;

  uint8_t res22[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_START_DET:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_START_DET_REG;

  uint8_t res23[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CLR_GEN_CALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_CLR_GEN_CALL_REG;

  uint8_t res24[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTRL_ENABLE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_ENABLE_REG;

  uint8_t res25[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t I2C_ACTIVITY:1;
      uint64_t TFNF:1;
      uint64_t TFE:1;
      uint64_t RFNE:1;
      uint64_t RFF:1;
      uint64_t MST_ACTIVITY:1;
      uint64_t SLV_ACTIVITY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_STATUS_REG;

  uint8_t res26[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TXFLR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_TXFLR_REG;

  uint8_t res27[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RXFLR:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_RXFLR_REG;

  uint8_t res28[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_SDA_HOLD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_SDA_HOLD_REG;

  uint8_t res29[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ABRT_7B_ADDR_NOACK:1;
      uint64_t ABRT_10ADDR1_NOACK:1;
      uint64_t ABRT_10ADDR2_NOACK:1;
      uint64_t ABRT_TXDATA_NOACK:1;
      uint64_t ABRT_GCALL_NOACK:1;
      uint64_t ABRT_GCALL_READ:1;
      uint64_t ABRT_HS_ACKDET:1;
      uint64_t ABRT_SBYTE_ACKDET:1;
      uint64_t ABRT_HS_NORSTRT:1;
      uint64_t ABRT_SBYTE_NORSTRT:1;
      uint64_t ABRT_10B_RD_NORSTRT:1;
      uint64_t ABRT_MASTER_DIS:1;
      uint64_t ARB_LOST:1;
      uint64_t ABRT_SLVFLUSH_TXFIFO:1;
      uint64_t ABRT_SLV_ARBLOST:1;
      uint64_t ABRT_SLVRD_INTX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_TX_ABRT_SOURCE_REG;

  uint8_t res30[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RDMAE:1;
      uint64_t TDMAE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_DMA_CR_REG;

  uint8_t res31[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMATDL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_DMA_TDLR_REG;

  uint8_t res32[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMARDL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_DMA_RDLR_REG;

  uint8_t res33[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SDA_SETUP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_SDA_SETUP_REG;

  uint8_t res34[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ACK_GEN_CALL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_ACK_GENERAL_CALL_REG;

  uint8_t res35[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_EN:1;
      uint64_t SLV_DISABLED_WHILE_BUSY:1;
      uint64_t SLV_RX_DATA_LOST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_ENABLE_STATUS_REG;

  uint8_t res36[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_FS_SPKLEN:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_IC_FS_SPKLEN_REG;

