iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res37[82];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP_PARAM1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_COMP_PARAM1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP_PARAM2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_COMP_PARAM2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP_VERSION:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_COMP_VERSION_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP2_VERSION:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_COMP2_VERSION;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP_TYPE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_COMP_TYPE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IC_COMP2_TYPE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) I2C2_COMP_TYPE2_REG;

};

#define I2C2 (*(volatile struct I2C2_tag *) 0x50001500)

struct IR_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t IR_FREQ_CARRIER_ON:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IR_FREQ_CARRIER_ON_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IR_FREQ_CARRIER_OFF:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IR_FREQ_CARRIER_OFF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IR_LOGIC_ONE_SPACE:8;
      uint64_t IR_LOGIC_ONE_MARK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IR_LOGIC_ONE_TIME_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IR_LOGIC_ZERO_SPACE:8;
      uint64_t IR_LOGIC_ZERO_MARK:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IR_LOGIC_ZERO_TIME_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IR_CODE_FIFO_RESET:1;
      uint64_t IR_REP_FIFO_RESET:1;
      uint64_t IR_ENABLE:1;
      uint64_t IR_TX_START:1;
      uint64_t IR_REPEAT_TYPE:1;
      uint64_t IR_INVERT_OUTPUT:1;
      uint64_t IR_LOGIC_ZERO_FORMAT:1;
      uint64_t IR_LOGIC_ONE_FORMAT:1;
      uint64_t IR_IRQ_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IR_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IR_CODE_FIFO_WRDS:6;
      uint64_t IR_REP_FIFO_WRDS:4;
      uint64_t IR_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IR_STATUS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IR_REPEAT_TIME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IR_REPEAT_TIME_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IR_CODE_FIFO_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IR_MAIN_FIFO_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IR_REPEAT_FIFO_DATA:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IR_REPEAT_FIFO_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IR_IRQ_ACK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) IR_IRQ_STATUS_REG;

};

#define IR (*(volatile struct IR_tag *) 0x50001700)

struct KBSCAN_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_EN:1;
      uint64_t KBSCN_IRQ_MESSAGE_MASK:1;
      uint64_t KBSCN_IRQ_INACTIVE_MASK:1;
      uint64_t KBSCN_IRQ_FIFO_MASK:1;
      uint64_t KBSCN_INACTIVE_TIME:7;
      uint64_t KBSCN_INACTIVE_EN:1;
      uint64_t KBSCN_CLKDIV:2;
      uint64_t KBSCN_RESET_FIFO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_ROW_ACTIVE_TIME:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MATRIX_ROW:4;
      uint64_t KBSCN_MATRIX_COLUMN:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_MATRIX_SIZE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_DEBOUNCE_RELEASE_TIME:6;
      uint64_t KBSCN_DEBOUNCE_PRESS_TIME:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_DEBOUNCE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MES_IRQ_STATUS:1;
      uint64_t KBSCN_INACTIVE_IRQ_STATUS:1;
      uint64_t KBSCN_NUM_MESSAGE:5;
      uint64_t KBSCN_FIFO_OVERFL:1;
      uint64_t KBSCN_FIFO_UNDERFL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_STATUS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_KEYID_ROW:4;
      uint64_t KBSCN_KEYID_COLUMN:5;
      uint64_t KBSCN_KEY_STATE:1;
      uint64_t KBSCN_LAST_ENTRY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_MESSAGE_KEY_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P00_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P01_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P02_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P03_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P04_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P05_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P06_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P07_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P10_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P11_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P12_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P13_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P14_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P15_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P16_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P17_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P20_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P21_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P22_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P23_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P24_MODE_REG;

  uint8_t res0[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P30_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P31_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P32_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P33_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P34_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P35_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P36_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P37_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P40_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P41_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P42_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P43_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P44_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P45_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P46_MODE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KBSCN_MODE:5;
      uint64_t KBSCN_ROW:1;
      uint64_t KBSCN_GPIO_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) KBSCN_P47_MODE_REG;

