iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define KBSCAN (*(volatile struct KBSCAN_tag *) 0x50001600)

struct OTPC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_MODE_MODE:3;
      uint64_t reservedSpace0:1;
      uint64_t OTPC_MODE_USE_DMA:1;
      uint64_t OTPC_MODE_FIFO_FLUSH:1;
      uint64_t OTPC_MODE_ERR_RESP_DIS:1;
      uint64_t reservedSpace1:1;
      uint64_t OTPC_MODE_USE_SP_ROWS:1;
      uint64_t OTPC_MODE_RLD_RR_REQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_MODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_PCTRL_WADDR:13;
      uint64_t reservedSpace0:1;
      uint64_t OTPC_PCTRL_PRETRY:1;
      uint64_t OTPC_PCTRL_PSTART:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_PCTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_STAT_PRDY:1;
      uint64_t OTPC_STAT_PERR_UNC:1;
      uint64_t OTPC_STAT_PERR_COR:1;
      uint64_t OTPC_STAT_PZERO:1;
      uint64_t OTPC_STAT_TRDY:1;
      uint64_t OTPC_STAT_TERROR:1;
      uint64_t OTPC_STAT_ARDY:1;
      uint64_t OTPC_STAT_RERROR:1;
      uint64_t OTPC_STAT_FWORDS:4;
      uint64_t reservedSpace0:4;
      uint64_t OTPC_STAT_NWORDS:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_STAT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t OTPC_AHBADR:30;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_AHBADR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_CELADR:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_CELADR_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_NWORDS:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_NWORDS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_FFPRT:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_FFPRT_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_FFRD:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_FFRD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_PWORDL:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_PWORDL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_PWORDH:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_PWORDH_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_TIM1_CC_T_CADX:8;
      uint64_t OTPC_TIM1_CC_T_PW:8;
      uint64_t OTPC_TIM1_CC_T_1US:6;
      uint64_t OTPC_TIM1_CC_T_500NS:5;
      uint64_t OTPC_TIM1_CC_T_200NS:4;
      uint64_t OTPC_TIM1_CC_T_25NS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_TIM1_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t OTPC_TIM2_CC_STBY_THR:10;
      uint64_t reservedSpace0:6;
      uint64_t OTPC_TIM2_CC_T_BCHK:7;
      uint64_t OTPC_TIM2_RDENL_PROT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) OTPC_TIM2_REG;

};

#define OTPC (*(volatile struct OTPC_tag *) 0x7f40000)

struct PATCH_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_VALID:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_VALID_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_VALID:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_VALID_SET_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_VALID:28;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_VALID_RESET_REG;

  uint8_t res0[20];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR0_REG;

  uint8_t res1[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR1_REG;

  uint8_t res2[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR2_REG;

  uint8_t res3[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR3_REG;

  uint8_t res4[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR4_REG;

  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR5_REG;

  uint8_t res6[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR6_REG;

  uint8_t res7[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR7_REG;

  uint8_t res8[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR8_REG;

  uint8_t res9[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR9_REG;

  uint8_t res10[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR10_REG;

  uint8_t res11[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR11_REG;

  uint8_t res12[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR12_REG;

  uint8_t res13[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR13_REG;

  uint8_t res14[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR14_REG;

  uint8_t res15[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR15_REG;

  uint8_t res16[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR16_REG;

  uint8_t res17[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR17_REG;

  uint8_t res18[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR18_REG;

  uint8_t res19[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t PATCH_ADDR_C:16;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR19_REG;

  uint8_t res20[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PATCH_ADDR_D:15;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR20_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_DATA20_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PATCH_ADDR_D:15;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR21_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_DATA21_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PATCH_ADDR_D:15;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR22_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_DATA22_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PATCH_ADDR_D:15;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR23_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_DATA23_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PATCH_ADDR_D:15;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR24_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_DATA24_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PATCH_ADDR_D:15;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR25_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_DATA25_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PATCH_ADDR_D:15;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR26_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_DATA26_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t PATCH_ADDR_D:15;
      uint64_t reservedSpace1:2;
      uint64_t PATCH_ADDR_19:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_ADDR27_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PATCH_DATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PATCH_DATA27_REG;

