iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define PATCH (*(volatile struct PATCH_tag *) 0x40050000)

struct PLLDIG_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHANNEL_ZERO:12;
      uint64_t SGN:1;
      uint64_t CS:1;
      uint64_t PLL_HSI_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SYNTH_CTRL1_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CHANNEL_ZERO:12;
      uint64_t SGN:1;
      uint64_t CS:1;
      uint64_t PLL_HSI_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SYNTH_CTRL1_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SD_ORDER_RX:2;
      uint64_t SD_ORDER_TX:2;
      uint64_t MODINDEX:2;
      uint64_t DELAY:2;
      uint64_t GAUSS_INV:1;
      uint64_t GAUSS_86:1;
      uint64_t TXDATA_INV:1;
      uint64_t EO_PACKET_DIS:1;
      uint64_t BT_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SYNTH_CTRL2_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SD_ORDER_RX:2;
      uint64_t SD_ORDER_TX:2;
      uint64_t reservedSpace0:2;
      uint64_t DELAY:2;
      uint64_t FTDF_MODINDEX:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SYNTH_CTRL2_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MODVAL_WR:14;
      uint64_t MODVAL_SEL:1;
      uint64_t ZIF_MODE_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SYNTH_CTRL3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VCO_FREQTRIM_WR:4;
      uint64_t VCO_FREQTRIM_SEL:2;
      uint64_t VCOCAL_PERIOD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_VCOCAL_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GAUSS_GAIN_WR:8;
      uint64_t GAUSS_GAIN_SEL:1;
      uint64_t BLE_TESTPAT_GEN:1;
      uint64_t MGAIN_CMP_INV:1;
      uint64_t MGAIN_AVER:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGAIN_CTRL_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK_GAIN_WR:6;
      uint64_t MSK_GAIN_SEL:1;
      uint64_t reservedSpace0:1;
      uint64_t MSK_GAIN_OFFSET:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGAIN_CTRL_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MGAIN_TRANSMIT_LENGTH:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGAIN_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VCO_CALCAP_BIT14:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_VCO_CALCAP_BIT14_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VCO_CALCAP_BIT15:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_VCO_CALCAP_BIT15_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CN_WR:6;
      uint64_t HSI_WR:1;
      uint64_t CN_SEL:1;
      uint64_t HSI_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_BMCW_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t KMOD_ALPHA_BLE:6;
      uint64_t KMOD_ALPHA_FTDF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_KMOD_ALPHA_REG;

  uint8_t res0[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GAUSS_GAIN_CAL_RD:8;
      uint64_t VCO_FREQTRIM_RD:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SYNTH_RESULT_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK_GAIN_CAL_RD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SYNTH_RESULT_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t GAUSS_GAIN_RD:8;
      uint64_t CN_CAL_RD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SYNTH_RESULT2_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK_GAIN_LOWER_RD:6;
      uint64_t MSK_GAIN_UPPER_RD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SYNTH_RESULT2_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CN_CAL_FTDF_RD:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SYNTH_RESULT3_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VCO_CALCAP_LOW:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CALCAP1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t VCO_CALCAP_HIGH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CALCAP2_REG;

  uint8_t res1[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FTDF_PHYATTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_FTDF_PHYATTR_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MDSTATE_RD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CALTRIM_STEP1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MDSTATE_RD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CALTRIM_STEP2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MDSTATE_RD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CALTRIM_STEP3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MDSTATE_RD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CALTRIM_STEP4_REG;

  uint8_t res2[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_DAC_DELAY:2;
      uint64_t INV_DAC_POL:1;
      uint64_t INV_SDM_POL:1;
      uint64_t DISABLE_DAC:1;
      uint64_t DISABLE_SDM:1;
      uint64_t TX_MOD_FROM_GPIO:1;
      uint64_t MSK_BYPASS_PHASE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MSKMOD_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_DATA:4;
      uint64_t TX_VALID:1;
      uint64_t MSK_TX_SEL:1;
      uint64_t MSK_ALW_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MSKMOD_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK_CHIPL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MSKMOD_CHIPL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MSK_CHIPH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MSKMOD_CHIPH_REG;

