iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res3[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MGAIN_COMP_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGAIN_COMP_VAL0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MGAIN_COMP_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGAIN_COMP_VAL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MGAIN_COMP_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGAIN_COMP_VAL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MGAIN_COMP_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGAIN_COMP_VAL3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MGAIN_COMP_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGAIN_COMP_VAL4_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MGAIN_COMP_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGAIN_COMP_VAL5_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MGAIN_COMP_VAL:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGAIN_COMP_VAL6_REG;

};

#define PLLDIG (*(volatile struct PLLDIG_tag *) 0x50002d00)

struct QSPIC_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_SET_SINGLE:1;
      uint64_t QSPIC_SET_DUAL:1;
      uint64_t QSPIC_SET_QUAD:1;
      uint64_t QSPIC_EN_CS:1;
      uint64_t QSPIC_DIS_CS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTRLBUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_AUTO_MD:1;
      uint64_t QSPIC_CLK_MD:1;
      uint64_t QSPIC_IO2_OEN:1;
      uint64_t QSPIC_IO3_OEN:1;
      uint64_t QSPIC_IO2_DAT:1;
      uint64_t QSPIC_IO3_DAT:1;
      uint64_t QSPIC_HRDY_MD:1;
      uint64_t QSPIC_RXD_NEG:1;
      uint64_t QSPIC_RPIPE_EN:1;
      uint64_t QSPIC_PCLK_MD:3;
      uint64_t QSPIC_FORCENSEQ_EN:1;
      uint64_t QSPIC_USE_32BA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CTRLMODE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_RECVDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_RECVDATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_INST:8;
      uint64_t QSPIC_INST_WB:8;
      uint64_t QSPIC_EXT_BYTE:8;
      uint64_t QSPIC_INST_TX_MD:2;
      uint64_t QSPIC_ADR_TX_MD:2;
      uint64_t QSPIC_EXT_TX_MD:2;
      uint64_t QSPIC_DMY_TX_MD:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_BURSTCMDA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_DAT_RX_MD:2;
      uint64_t QSPIC_EXT_BYTE_EN:1;
      uint64_t QSPIC_EXT_HF_DS:1;
      uint64_t QSPIC_DMY_NUM:2;
      uint64_t QSPIC_INST_MD:1;
      uint64_t QSPIC_WRAP_MD:1;
      uint64_t QSPIC_WRAP_LEN:2;
      uint64_t QSPIC_WRAP_SIZE:2;
      uint64_t QSPIC_CS_HIGH_MIN:3;
      uint64_t QSPIC_DMY_FORCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_BURSTCMDB_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_STATUS_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_WRITEDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_WRITEDATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_READDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_READDATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_DUMMYDATA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_DUMMYDATA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:4;
      uint64_t QSPIC_ERS_ADDR:20;
      uint64_t QSPIC_ERASE_EN:1;
      uint64_t QSPIC_ERS_STATE:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_ERASECTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_ERS_INST:8;
      uint64_t QSPIC_WEN_INST:8;
      uint64_t QSPIC_SUS_INST:8;
      uint64_t QSPIC_RES_INST:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_ERASECMDA_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_ERS_TX_MD:2;
      uint64_t QSPIC_WEN_TX_MD:2;
      uint64_t QSPIC_SUS_TX_MD:2;
      uint64_t QSPIC_RES_TX_MD:2;
      uint64_t QSPIC_EAD_TX_MD:2;
      uint64_t QSPIC_ERS_CS_HI:5;
      uint64_t reservedSpace0:1;
      uint64_t QSPIC_ERSRES_HLD:4;
      uint64_t reservedSpace1:4;
      uint64_t QSPIC_RESSUS_DLY:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_ERASECMDB_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_BRK_WRD:16;
      uint64_t QSPIC_BRK_EN:1;
      uint64_t QSPIC_BRK_SZ:1;
      uint64_t QSPIC_BRK_TX_MD:2;
      uint64_t QSPIC_SEC_HF_DS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_BURSTBRK_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_RSTAT_INST:8;
      uint64_t QSPIC_RSTAT_TX_MD:2;
      uint64_t QSPIC_RSTAT_RX_MD:2;
      uint64_t QSPIC_BUSY_POS:3;
      uint64_t QSPIC_BUSY_VAL:1;
      uint64_t QSPIC_RESSTS_DLY:6;
      uint64_t QSPIC_STSDLY_SEL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_STATUSCMD_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_CHCKERASE:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_CHCKERASE_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t QSPIC_PADS_DRV:2;
      uint64_t QSPIC_PADS_SLEW:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_GP_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t QSPIC_UCODE_X:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) QSPIC_UCODE_START;

};

#define QSPIC (*(volatile struct QSPIC_tag *) 0xc000000)

struct QUAD_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t QD_IRQ_MASK:1;
      uint64_t QD_IRQ_CLR:1;
      uint64_t QD_IRQ_STATUS:1;
      uint64_t QD_IRQ_THRES:7;
      uint64_t CHX_PORT_EN:1;
      uint64_t CHY_PORT_EN:1;
      uint64_t CHZ_PORT_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QDEC_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t X_counter:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QDEC_XCNT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t Y_counter:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QDEC_YCNT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t Z_counter:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QDEC_ZCNT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t clock_divider:10;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) QDEC_CLOCKDIV_REG;

