iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define QUAD (*(volatile struct QUAD_tag *) 0x50001a00)

struct RFCU_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_EN_OVR:2;
      uint64_t RX_EN_OVR:2;
      uint64_t RF_MODE_OVR:2;
      uint64_t IFF_FTDF_OVR:2;
      uint64_t MIX_FTDF_OVR:2;
      uint64_t TXDAC_SEL:2;
      uint64_t GAUSS_DAC_SEL:2;
      uint64_t CN_FTDF_TIMES2:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_OVERRULE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIAGIRQ_MASK_0:1;
      uint64_t DIAGIRQ_WSEL_0:2;
      uint64_t DIAGIRQ_BSEL_0:3;
      uint64_t DIAGIRQ_EDGE_0:1;
      uint64_t reservedSpace0:1;
      uint64_t DIAGIRQ_MASK_1:1;
      uint64_t DIAGIRQ_WSEL_1:2;
      uint64_t DIAGIRQ_BSEL_1:3;
      uint64_t DIAGIRQ_EDGE_1:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DIAGIRQ01_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIAGIRQ_MASK_2:1;
      uint64_t DIAGIRQ_WSEL_2:2;
      uint64_t DIAGIRQ_BSEL_2:3;
      uint64_t DIAGIRQ_EDGE_2:1;
      uint64_t reservedSpace0:1;
      uint64_t DIAGIRQ_MASK_3:1;
      uint64_t DIAGIRQ_WSEL_3:2;
      uint64_t DIAGIRQ_BSEL_3:3;
      uint64_t DIAGIRQ_EDGE_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DIAGIRQ23_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIAGIRQ_STAT_0:1;
      uint64_t DIAGIRQ_STAT_1:1;
      uint64_t DIAGIRQ_STAT_2:1;
      uint64_t DIAGIRQ_STAT_3:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DIAGIRQ_STAT_REG;

  uint8_t res0[8];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CALSTATE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CALSTATE_REG;

  uint8_t res1[30];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LF_RES:4;
      uint64_t CP_CUR:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SCAN_FEEDBACK_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CNT_RO:6;
      uint64_t CNT_CLK:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_REF_OSC_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CNT_RO:6;
      uint64_t CNT_CLK:9;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_REF_OSC_FTDF_REG;

  uint8_t res2[10];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SO_CAL:1;
      uint64_t EO_CAL:1;
      uint64_t MGAIN_CAL_DIS:1;
      uint64_t IFF_CAL_DIS:1;
      uint64_t DC_OFFSET_CAL_DIS:1;
      uint64_t VCO_CAL_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CAL_CTRL_REG;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t EO_CAL_CLEAR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_IRQ_CTRL_REG;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ADC_OFFP_I_RD:8;
      uint64_t ADC_OFFN_I_RD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ADCI_DC_OFFSET_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ADC_OFFP_Q_RD:8;
      uint64_t ADC_OFFN_Q_RD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ADCQ_DC_OFFSET_REG;

  uint8_t res5[36];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RF_XTAL_RFCLK_TEST:1;
      uint64_t RF_XTAL_PLL_DXTAL16_TEST:1;
      uint64_t RF_VTUNE_TO_ADC_TEST_EN:1;
      uint64_t reservedSpace0:4;
      uint64_t RFCU_TXRX_EN_OLD:1;
      uint64_t VCO_AMPL_SET_TX:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SPARE1_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RF_XTAL_RFCLK_TEST:1;
      uint64_t RF_XTAL_PLL_DXTAL16_TEST:1;
      uint64_t RF_VTUNE_TO_ADC_TEST_EN:1;
      uint64_t reservedSpace0:8;
      uint64_t DEM_AFC_ACTIVATION_MODE:1;
      uint64_t VCO_COARSECAL_DELAY:2;
      uint64_t DEM_PAD_WRAP:1;
      uint64_t DEM_PAD_SAT_TO_ZERO:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_SPARE1_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MIX_BIAS_BLE_SET:4;
      uint64_t CP_BIAS_BLE_SET:4;
      uint64_t VCO_BIAS_BLE_SET:4;
      uint64_t IFF_BIAS_BLE_SET:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_BIAS_CTRL1_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MIX_BIAS_FTDF_SET:4;
      uint64_t CP_BIAS_FTDF_SET:4;
      uint64_t VCO_BIAS_FTDF_SET:4;
      uint64_t IFF_BIAS_FTDF_SET:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_BIAS_CTRL1_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IF_CAL_CAP:5;
      uint64_t IF_MUTE:1;
      uint64_t IFF_DCOC_DAC_DIS:1;
      uint64_t RO_TO_PINS:1;
      uint64_t IF_SEL_SET2_GT:4;
      uint64_t IF_SELECT_FSM:1;
      uint64_t IFF_COMPLEX_DIS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_IFF_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ADC_DC_OFFSET_SEL:1;
      uint64_t reservedSpace0:12;
      uint64_t ADC_MUTE:1;
      uint64_t ADC_SIGN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ADC_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ADC_OFFP_I_WR:8;
      uint64_t ADC_OFFN_I_WR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ADC_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ADC_OFFP_Q_WR:8;
      uint64_t ADC_OFFN_Q_WR:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ADC_CTRL3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:5;
      uint64_t PA_RAMPSPEED:2;
      uint64_t reservedSpace1:4;
      uint64_t LEVEL_LDO_RFPA:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_PA_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MGC_GAIN_SET:1;
      uint64_t MGC_POLE_SW:1;
      uint64_t GAUSS_DAC_CTRL:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MGC_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TUNE_VAR_V0:3;
      uint64_t TUNE_VAR_V1:3;
      uint64_t TUNE_VAR_V2:3;
      uint64_t TUNE_VAR_V3:3;
      uint64_t MOD_VAR_V0:2;
      uint64_t MOD_VAR_V1:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_VCOVAR_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t FIXED_CUR_SET:2;
      uint64_t FIXED_CUR_EN:1;
      uint64_t PFD_POLARITY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_PFD_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CP_CUR_SET_BLE_RX:4;
      uint64_t CP_CUR_SET_BLE_TX:4;
      uint64_t CP_CUR_BLE_RX:4;
      uint64_t CP_CUR_BLE_TX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CP_CTRL_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CP_CUR_SET_FTDF_RX:4;
      uint64_t CP_CUR_SET_FTDF_TX:4;
      uint64_t CP_CUR_FTDF_RX:4;
      uint64_t CP_CUR_FTDF_TX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CP_CTRL_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LF_RES_SET_BLE_RX:4;
      uint64_t LF_RES_SET_BLE_TX:4;
      uint64_t LF_RES_BLE_RX:4;
      uint64_t LF_RES_BLE_TX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_LF_RES_CTRL_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LF_RES_SET_FTDF_RX:4;
      uint64_t LF_RES_SET_FTDF_TX:4;
      uint64_t LF_RES_FTDF_RX:4;
      uint64_t LF_RES_FTDF_TX:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_LF_RES_CTRL_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MIX_TRIM_GMBIAS_BLE:4;
      uint64_t MIX_TRIM_IBIAS_BLE:4;
      uint64_t MIX_TRIM_VCM_BLE:4;
      uint64_t MIX_SPARE_BLE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MIXER_CTRL1_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MIX_TRIM_GMBIAS_FTDF:4;
      uint64_t MIX_TRIM_IBIAS_FTDF:4;
      uint64_t MIX_TRIM_VCM_FTDF:4;
      uint64_t MIX_SPARE:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MIXER_CTRL1_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MIX_CAL_CAP_WR:5;
      uint64_t MIX_CAL_SELECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MIXER_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LF_CAL_CAP_WR:5;
      uint64_t LF_CAL_CAP_SEL:1;
      uint64_t LF_SHORT_R4_BLE:1;
      uint64_t LF_SHORT_R4_FTDF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_LF_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTRL_FAST:4;
      uint64_t CTRL_SLOW:4;
      uint64_t CAL_PH_1:1;
      uint64_t CAL_PH_2:1;
      uint64_t REF_CTRL:2;
      uint64_t TDC_CONNECT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TDC_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RFIO_TRIM1_CAP:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_IO_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LNA_TRIM_CD_LF:6;
      uint64_t LNA_TRIM_CD_HF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_LNA_CTRL1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LNA_TRIM_GM_HI:6;
      uint64_t LNA_TRIM_GM_LO:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_LNA_CTRL2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LNA_TRIM_CGS:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_LNA_CTRL3_REG;

