iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  uint8_t res6[14];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_POWER_SET:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TX_PWR_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_PWR_RF_IO_CTRL1_REG:2;
      uint64_t TX_PWR_RF_PA_CTRL_REG:4;
      uint64_t TX_PWR_RF_LNA_CTRL3_REG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TX_PWR_LUT_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_PWR_RF_IO_CTRL1_REG:2;
      uint64_t TX_PWR_RF_PA_CTRL_REG:4;
      uint64_t TX_PWR_RF_LNA_CTRL3_REG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TX_PWR_LUT_2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_PWR_RF_IO_CTRL1_REG:2;
      uint64_t TX_PWR_RF_PA_CTRL_REG:4;
      uint64_t TX_PWR_RF_LNA_CTRL3_REG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TX_PWR_LUT_3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_PWR_RF_IO_CTRL1_REG:2;
      uint64_t TX_PWR_RF_PA_CTRL_REG:4;
      uint64_t TX_PWR_RF_LNA_CTRL3_REG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TX_PWR_LUT_4_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_PWR_RF_IO_CTRL1_REG:2;
      uint64_t TX_PWR_RF_PA_CTRL_REG:4;
      uint64_t TX_PWR_RF_LNA_CTRL3_REG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TX_PWR_LUT_5_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_PWR_RF_IO_CTRL1_REG:2;
      uint64_t TX_PWR_RF_PA_CTRL_REG:4;
      uint64_t TX_PWR_RF_LNA_CTRL3_REG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TX_PWR_LUT_7_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TX_PWR_RF_IO_CTRL1_REG:2;
      uint64_t TX_PWR_RF_PA_CTRL_REG:4;
      uint64_t TX_PWR_RF_LNA_CTRL3_REG:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TX_PWR_LUT_6_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RF_TX_PWR_LUT_RD:11;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TX_PWR_LUT_RD_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIV2_OFFN_TRIM_RX:4;
      uint64_t DIV2_OFFP_TRIM_RX:4;
      uint64_t DIV2_IQ_TRIM_RX_SPARE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DIV_IQ_RX_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DIV2_OFFN_TRIM_TX:4;
      uint64_t DIV2_OFFP_TRIM_TX:4;
      uint64_t DIV2_IQ_TRIM_TX_SPARE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_DIV_IQ_TX_REG;

  uint8_t res7[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RF_LO_IQ_TRIM:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_LO_IQ_TRIM_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t TXDAC_CAP_SEL:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_TXDAC_CTRL_REG;

  uint8_t res8[4];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IF_CAL_CAP_RD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_IFF_RESULT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IF_CAL_CAP_WR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_IFF_CC_BLE_SET1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IF_CAL_CAP_WR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_IFF_CC_BLE_SET2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IF_CAL_CAP_WR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_IFF_CC_FTDF_SET1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IF_CAL_CAP_WR:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_IFF_CC_FTDF_SET2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IF_CAL_CAP_RD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_IFF_CAL_CAP_STAT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t MIX_CAL_CAP_RD:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_MIX_CAL_CAP_STAT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t LF_CAL_CAP_RD:5;
      uint64_t LF_SHORT_R4_RD:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_LF_CAL_CAP_STAT_REG;

};

#define RFCU (*(volatile struct RFCU_tag *) 0x50002010)

struct RFCU_POWER_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t lna_ldo_en_ble_dcf_rx:5;
      uint64_t lna_ldo_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG0_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lna_core_en_ble_dcf_rx:5;
      uint64_t lna_core_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG1_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lna_cgm_en_ble_dcf_rx:5;
      uint64_t lna_cgm_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG2_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t mix_ldo_en_ble_dcf_rx:5;
      uint64_t mix_ldo_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG3_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t iff_ldo_en_ble_dcf_rx:5;
      uint64_t iff_ldo_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG4_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t iffadc_ldo_en_ble_dcf_rx:5;
      uint64_t iffadc_ldo_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG5_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t vco_ldo_en_ble_dcf_rx:5;
      uint64_t vco_ldo_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG6_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t md_ldo_en_ble_dcf_rx:5;
      uint64_t md_ldo_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG7_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pfd_ldo_en_ble_dcf_rx:5;
      uint64_t pfd_ldo_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG8_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pa_ldo_en_ble_dcf_rx:5;
      uint64_t pa_ldo_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG9_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t cp_switch_en_ble_dcf_rx:5;
      uint64_t cp_switch_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG10_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t vco_bias_en_ble_dcf_rx:5;
      uint64_t vco_bias_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG11_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t cp_bias_en_ble_dcf_rx:5;
      uint64_t cp_bias_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG12_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lna_ldo_zero_ble_dcf_rx:5;
      uint64_t lna_ldo_zero_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG13_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pa_ramp_en_ble_dcf_rx:5;
      uint64_t pa_ramp_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG14_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pa_en_ble_dcf_rx:5;
      uint64_t pa_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG15_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t mix_en_ble_dcf_rx:5;
      uint64_t mix_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG16_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t iff_en_ble_dcf_rx:5;
      uint64_t iff_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG17_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t adc_en_ble_dcf_rx:5;
      uint64_t adc_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG18_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t vco_en_ble_dcf_rx:5;
      uint64_t vco_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG19_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lobuf_md_en_ble_dcf_rx:5;
      uint64_t lobuf_md_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG20_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t cp_en_ble_dcf_rx:5;
      uint64_t cp_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG21_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pfd_en_ble_dcf_rx:5;
      uint64_t pfd_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG22_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t gauss_en_ble_dcf_rx:5;
      uint64_t gauss_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG23_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t rfio_txrx_ble_dcf_rx:5;
      uint64_t rfio_txrx_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG24_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lobuf_pa_en_ble_dcf_rx:5;
      uint64_t lobuf_pa_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG25_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lobuf_rxiq_en_ble_dcf_rx:5;
      uint64_t lobuf_rxiq_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG26_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t div2_en_ble_dcf_rx:5;
      uint64_t div2_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG27_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t cp_bias_sh_open_ble_dcf_rx:5;
      uint64_t cp_bias_sh_open_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG28_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t vco_bias_sh_open_ble_dcf_rx:5;
      uint64_t vco_bias_sh_open_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG29_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t iffmix_bias_sh_open_ble_dcf_rx:5;
      uint64_t iffmix_bias_sh_open_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG30_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t gauss_bias_sh_ble_dcf_rx:5;
      uint64_t gauss_bias_sh_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG31_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t mix_bias_sh_ble_dcf_rx:5;
      uint64_t mix_bias_sh_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG32_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pll_dig_en_ble_dcf_rx:5;
      uint64_t pll_dig_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG33_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pllclosed_en_ble_dcf_rx:5;
      uint64_t pllclosed_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG34_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t dem_en_ble_dcf_rx:5;
      uint64_t dem_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG35_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ldo_zero_en_ble_dcf_rx:5;
      uint64_t ldo_zero_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG36_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t cal_en_ble_dcf_rx:5;
      uint64_t cal_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG37_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t tdc_en_ble_dcf_rx:5;
      uint64_t tdc_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG38_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ldo_rfio_en_ble_dcf_rx:5;
      uint64_t ldo_rfio_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG39_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t rfio_bias_en_ble_dcf_rx:5;
      uint64_t rfio_bias_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG40_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t rfio_bias_sh_ble_dcf_rx:5;
      uint64_t rfio_bias_sh_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG41_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ldo_radio_en_ble_dcf_rx:5;
      uint64_t ldo_radio_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG42_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t adc_clk_en_ble_dcf_rx:5;
      uint64_t adc_clk_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG43_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t tr_pwm_off_en_ble_dcf_rx:5;
      uint64_t tr_pwm_off_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG44_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t txdac_en_ble_dcf_rx:5;
      uint64_t txdac_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG45_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t dcparcal_en_ble_dcf_rx:5;
      uint64_t spare2_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG46_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t agcunfreeze_en_ble_dcf_rx:5;
      uint64_t spare3_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG47_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t sigdetect_en_ble_dcf_rx:5;
      uint64_t spare4_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG48_BLE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t dem_ftdf_en_ble_dcf_rx:5;
      uint64_t dem_ftdf_en_ble_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG49_BLE_REG;

  uint8_t res0[28];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lna_ldo_en_ftdf_dcf_rx:5;
      uint64_t lna_ldo_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG0_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lna_core_en_ftdf_dcf_rx:5;
      uint64_t lna_core_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG1_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lna_cgm_en_ftdf_dcf_rx:5;
      uint64_t lna_cgm_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG2_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t mix_ldo_en_ftdf_dcf_rx:5;
      uint64_t mix_ldo_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG3_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t iff_ldo_en_ftdf_dcf_rx:5;
      uint64_t iff_ldo_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG4_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t iffadc_ldo_en_ftdf_dcf_rx:5;
      uint64_t iffadc_ldo_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG5_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t vco_ldo_en_ftdf_dcf_rx:5;
      uint64_t vco_ldo_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG6_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t md_ldo_en_ftdf_dcf_rx:5;
      uint64_t md_ldo_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG7_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pfd_ldo_en_ftdf_dcf_rx:5;
      uint64_t pfd_ldo_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG8_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pa_ldo_en_ftdf_dcf_rx:5;
      uint64_t pa_ldo_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG9_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t cp_switch_en_ftdf_dcf_rx:5;
      uint64_t cp_switch_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG10_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t vco_bias_en_ftdf_dcf_rx:5;
      uint64_t vco_bias_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG11_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t cp_bias_en_tfdf_dcf_rx:5;
      uint64_t cp_bias_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG12_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lna_ldo_zero_ftdf_dcf_rx:5;
      uint64_t lna_ldo_zero_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG13_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pa_ramp_en_ftdf_dcf_rx:5;
      uint64_t pa_ramp_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG14_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pa_en_ftdf_dcf_rx:5;
      uint64_t pa_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG15_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t mix_en_ftdf_dcf_rx:5;
      uint64_t mix_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG16_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t iff_en_ftdf_dcf_rx:5;
      uint64_t iff_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG17_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t adc_en_ftdf_dcf_rx:5;
      uint64_t adc_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG18_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t vco_en_ftdf_dcf_rx:5;
      uint64_t vco_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG19_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lobuf_md_en_ftdf_dcf_rx:5;
      uint64_t lobuf_md_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG20_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t cp_en_ftdf_dcf_rx:5;
      uint64_t cp_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG21_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pfd_en_ftdf_dcf_rx:5;
      uint64_t pfd_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG22_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t gauss_en_ftdf_dcf_rx:5;
      uint64_t gauss_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG23_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t rfio_txrx_ftdf_dcf_rx:5;
      uint64_t rfio_txrx_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG24_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lobuf_pa_en_ftdf_dcf_rx:5;
      uint64_t lobuf_pa_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG25_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t lobuf_rxiq_en_ftdf_dcf_rx:5;
      uint64_t lobuf_rxiq_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG26_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t div2_en_ftdf_dcf_rx:5;
      uint64_t div2_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG27_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t cp_bias_sh_open_ftdf_dcf_rx:5;
      uint64_t cp_bias_sh_open_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG28_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t vco_bias_sh_open_ftdf_dcf_rx:5;
      uint64_t vco_bias_sh_open_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG29_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t iffmix_bias_sh_ftdf_dcf_rx:5;
      uint64_t iffmix_bias_sh_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG30_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t gauss_bias_sh_ftdf_dcf_rx:5;
      uint64_t gauss_bias_sh_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG31_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t mix_bias_sh_ftdf_dcf_rx:5;
      uint64_t mix_bias_sh_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG32_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pll_dig_en_ftdf_dcf_rx:5;
      uint64_t pll_dig_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG33_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t pllclosed_en_ftdf_dcf_rx:5;
      uint64_t pllclosed_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG34_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t dem_en_ftdf_dcf_rx:5;
      uint64_t dem_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG35_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ldo_zero_en_ftdf_dcf_rx:5;
      uint64_t ldo_zero_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG36_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t cal_en_ftdf_dcf_rx:5;
      uint64_t cal_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG37_FTDF_REG;

