iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
  union
  {
    uint16_t R;
    struct
    {
      uint64_t tdc_en_ftdf_dcf_rx:5;
      uint64_t tdc_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG38_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ldo_rfio_en_ftdf_dcf_rx:5;
      uint64_t ldo_rfio_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG39_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t rfio_bias_en_ftdf_dcf_rx:5;
      uint64_t rfio_bias_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG40_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t rfio_bias_sh_ftdf_dcf_rx:5;
      uint64_t rfio_bias_sh_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG41_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ldo_radio_en_ftdf_dcf_rx:5;
      uint64_t ldo_radio_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG42_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t adc_clk_en_ftdf_dcf_rx:5;
      uint64_t adc_clk_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG43_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t tr_pwm_off_en_ftdf_dcf_rx:5;
      uint64_t tr_pwm_off_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG44_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t txdac_en_ftdf_dcf_rx:5;
      uint64_t txdac_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG45_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t dcparcal_en_ftdf_dcf_rx:5;
      uint64_t spare2_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG46_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t agcunfreeze_en_ftdf_dcf_rx:5;
      uint64_t spare3_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG47_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t sigdetect_en_ftdf_dcf_rx:5;
      uint64_t spare4_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG48_FTDF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t dem_ftdf_en_ftdf_dcf_rx:5;
      uint64_t dem_ftdf_en_ftdf_dcf_tx:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ENABLE_CONFIG49_FTDF_REG;

  uint8_t res1[30];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_4_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_5_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_6_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_7_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_8_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_9_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_10_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_11_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_12_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_13_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_14_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_15_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_16_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_17_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_18_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_19_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_20_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_21_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_22_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_23_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_24_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_25_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_26_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_27_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_28_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_29_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_30_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SET_OFFSET:8;
      uint64_t RESET_OFFSET:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_CNTRL_TIMER_31_REG;

  uint8_t res2[64];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ALW_EN_LNA_LDO_EN:1;
      uint64_t ALW_EN_LNA_CORE_EN:1;
      uint64_t ALW_EN_LNA_CGM_EN:1;
      uint64_t ALW_EN_MIX_LDO_EN:1;
      uint64_t ALW_EN_IFF_LDO_EN:1;
      uint64_t ALW_EN_IFFADC_LDO_EN:1;
      uint64_t ALW_EN_VCO_LDO_EN:1;
      uint64_t ALW_EN_MD_LDO_EN:1;
      uint64_t ALW_EN_PFD_LDO_EN:1;
      uint64_t ALW_EN_PA_LDO_EN:1;
      uint64_t ALW_EN_CP_SWITCH_EN:1;
      uint64_t ALW_EN_VCO_BIAS_EN:1;
      uint64_t ALW_EN_CP_BIAS_EN:1;
      uint64_t ALW_EN_LNA_LDO_ZERO:1;
      uint64_t ALW_EN_PA_RAMP_EN:1;
      uint64_t ALW_EN_PA_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ALWAYS_EN1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ALW_EN_MIX_EN:1;
      uint64_t ALW_EN_IFF_EN:1;
      uint64_t ALW_EN_ADC_EN:1;
      uint64_t ALW_EN_VCO_EN:1;
      uint64_t ALW_EN_LOBUF_MD_EN:1;
      uint64_t ALW_EN_CP_EN:1;
      uint64_t ALW_EN_PDF_EN:1;
      uint64_t ALW_EN_GAUSS_EN:1;
      uint64_t ALW_EN_RFIO_TXRX:1;
      uint64_t ALW_EN_LOBUF_PA_EN:1;
      uint64_t ALW_EN_RXIQ_EN:1;
      uint64_t ALW_EN_DIV2_EN:1;
      uint64_t ALW_EN_CP_BIAS_SH_OPEN:1;
      uint64_t ALW_EN_VCO_BIAS_SH_OPEN:1;
      uint64_t ALW_EN_IFFMIX_BIAS_SH_OPEN:1;
      uint64_t ALW_EN_GAUSS_BIAS_SH:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ALWAYS_EN2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ALW_EN_MIX_BIAS_SH:1;
      uint64_t ALW_EN_PLL_DIG_EN:1;
      uint64_t ALW_EN_PLLCLOSED_EN:1;
      uint64_t ALW_EN_DEM_EN:1;
      uint64_t ALW_EN_LDO_ZERO_EN:1;
      uint64_t ALW_EN_CAL_EN:1;
      uint64_t ALW_EN_TDC_EN:1;
      uint64_t ALW_EN_LDO_RFIO_EN:1;
      uint64_t ALW_EN_RFIO_BIAS_EN:1;
      uint64_t ALW_EN_RFIO_BIAS_SH:1;
      uint64_t ALW_EN_LDO_RADIO_EN:1;
      uint64_t ALW_EN_ADC_CLK_EN:1;
      uint64_t ALW_EN_TR_PWRM_OFF_EN:1;
      uint64_t ALW_EN_TXDAC_EN:1;
      uint64_t ALW_EN_SPARE2_EN:1;
      uint64_t ALW_EN_SPARE3_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ALWAYS_EN3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ALW_EN_SPARE4_EN:1;
      uint64_t ALW_EN_DEM_FTDF_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_ALWAYS_EN4_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RF_PORT0_RX:1;
      uint64_t RF_PORT0_TX:1;
      uint64_t RF_PORT1_RX:1;
      uint64_t RF_PORT1_TX:1;
      uint64_t RF_PORT2_RX:1;
      uint64_t RF_PORT2_TX:1;
      uint64_t RF_PORT3_RX:1;
      uint64_t RF_PORT3_TX:1;
      uint64_t RF_PORT4_RX:1;
      uint64_t RF_PORT4_TX:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_PORT_EN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RF_PORT0_POL:1;
      uint64_t RF_PORT1_POL:1;
      uint64_t RF_PORT2_POL:1;
      uint64_t RF_PORT3_POL:1;
      uint64_t RF_PORT4_POL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RF_PORT_POL_REG;

