iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define RFCU_POWER (*(volatile struct RFCU_POWER_tag *) 0x50002200)

struct RFPT_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t RFPT_PACK_EN:1;
      uint64_t RFPT_PACK_SEL:2;
      uint64_t RFPT_PACK_ADC_TYPE:1;
      uint64_t RFPT_CIRC_EN:1;
      uint64_t RFPT_BREQ_FORCE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RFPT_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RFPT_ADDRL:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RFPT_ADDRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RFPT_ADDRH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RFPT_ADDRH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RFPT_LEN:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RFPT_LEN_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RFPT_ACTIVE:1;
      uint64_t RFPT_OFLOW_STK:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RFPT_STAT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t RFPT_CRV_ADDRL:14;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RFPT_CRV_ADDRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RFPT_CRV_ADDRH:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RFPT_CRV_ADDRH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t RFPT_CRV_LEN:15;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) RFPT_CRV_LEN_REG;

};

#define RFPT (*(volatile struct RFPT_tag *) 0x50003600)

struct SPI_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPI_ON:1;
      uint64_t SPI_PHA:1;
      uint64_t SPI_POL:1;
      uint64_t SPI_CLK:2;
      uint64_t SPI_DO:1;
      uint64_t SPI_SMN:1;
      uint64_t SPI_WORD:2;
      uint64_t SPI_RST:1;
      uint64_t SPI_FORCE_DO:1;
      uint64_t SPI_TXH:1;
      uint64_t SPI_DI:1;
      uint64_t SPI_INT_BIT:1;
      uint64_t SPI_MINT:1;
      uint64_t SPI_EN_CTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SPI_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPI_DATA0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SPI_RX_TX_REG0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPI_DATA1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SPI_RX_TX_REG1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPI_CLEAR_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SPI_CLEAR_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPI_FIFO_MODE:2;
      uint64_t SPI_PRIORITY:1;
      uint64_t SPI_BUSY:1;
      uint64_t SPI_9BIT_VAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SPI_CTRL_REG1;

};

#define SPI (*(volatile struct SPI_tag *) 0x50001200)

struct SPI2_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPI_ON:1;
      uint64_t SPI_PHA:1;
      uint64_t SPI_POL:1;
      uint64_t SPI_CLK:2;
      uint64_t SPI_DO:1;
      uint64_t SPI_SMN:1;
      uint64_t SPI_WORD:2;
      uint64_t SPI_RST:1;
      uint64_t SPI_FORCE_DO:1;
      uint64_t SPI_TXH:1;
      uint64_t SPI_DI:1;
      uint64_t SPI_INT_BIT:1;
      uint64_t SPI_MINT:1;
      uint64_t SPI_EN_CTRL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SPI2_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPI_DATA0:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SPI2_RX_TX_REG0;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPI_DATA1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SPI2_RX_TX_REG1;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPI_CLEAR_INT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SPI2_CLEAR_INT_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SPI_FIFO_MODE:2;
      uint64_t SPI_PRIORITY:1;
      uint64_t SPI_BUSY:1;
      uint64_t SPI_9BIT_VAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) SPI2_CTRL_REG1;

};

#define SPI2 (*(volatile struct SPI2_tag *) 0x50001300)

struct TIMER1_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_EN:1;
      uint64_t CAPTIM_ONESHOT_MODE_EN:1;
      uint64_t CAPTIM_COUNT_DOWN_EN:1;
      uint64_t CAPTIM_IN1_EVENT_FALL_EN:1;
      uint64_t CAPTIM_IN2_EVENT_FALL_EN:1;
      uint64_t CAPTIM_IRQ_EN:1;
      uint64_t CAPTIM_FREE_RUN_MODE_EN:1;
      uint64_t CAPTIM_SYS_CLK_EN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_TIMER_VALUE:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_TIMER_VAL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_IN1_STATE:1;
      uint64_t CAPTIM_IN2_STATE:1;
      uint64_t CAPTIM_ONESHOT_PHASE:2;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_STATUS_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_GPIO1_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_GPIO1_CONF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_GPIO2_CONF:6;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_GPIO2_CONF_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_RELOAD:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_RELOAD_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_SHOTWIDTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_SHOTWIDTH_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_PRESCALER:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_PRESCALER_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_CAPTURE_GPIO1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_CAPTURE_GPIO1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_CAPTURE_GPIO2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_CAPTURE_GPIO2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_PRESCALER_VAL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_PRESCALER_VAL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_PWM_FREQ:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_PWM_FREQ_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CAPTIM_PWM_DC:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) CAPTIM_PWM_DC_REG;

