iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define TIMER1 (*(volatile struct TIMER1_tag *) 0x50000200)

struct TRNG_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRNG_ENABLE:1;
      uint64_t TRNG_MODE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRNG_CTRL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRNG_FIFOLVL:5;
      uint64_t TRNG_FIFOFULL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRNG_FIFOLVL_REG;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TRNG_SVN:16;
      uint64_t TRNG_MIN:8;
      uint64_t TRNG_MAJ:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) TRNG_VER_REG;

};

#define TRNG (*(volatile struct TRNG_tag *) 0x50005000)

struct UART_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t RBR_THR_DLL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_RBR_THR_DLL_REG;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ERBFI_dlh0:1;
      uint64_t ETBEI_dlh1:1;
      uint64_t ELSI_dhl2:1;
      uint64_t reservedSpace0:4;
      uint64_t PTIME_dlh7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_IER_DLH_REG;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IIR_FCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_IIR_FCR_REG;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_DLS:2;
      uint64_t UART_STOP:1;
      uint64_t UART_PEN:1;
      uint64_t UART_EPS:1;
      uint64_t reservedSpace0:1;
      uint64_t UART_BC:1;
      uint64_t UART_DLAB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_LCR_REG;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:2;
      uint64_t UART_OUT1:1;
      uint64_t UART_OUT2:1;
      uint64_t UART_LB:1;
      uint64_t reservedSpace1:1;
      uint64_t UART_SIRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_MCR_REG;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_DR:1;
      uint64_t UART_OE:1;
      uint64_t UART_PE:1;
      uint64_t UART_FE:1;
      uint64_t UART_BI:1;
      uint64_t UART_THRE:1;
      uint64_t UART_TEMT:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_LSR_REG;

  uint8_t res5[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_SCRATCH_PAD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_SCR_REG;

  uint8_t res6[94];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_BUSY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_USR_REG;

  uint8_t res7[10];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_UR:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_SRR_REG;

  uint8_t res8[6];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_SHADOW_BREAK_CONTROL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_SBCR_REG;

  uint8_t res9[22];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t DMASA:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_DMASA_REG;

  uint8_t res10[22];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_DLF:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_DLF_REG;

  uint8_t res11[50];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CPR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_CPR_REG;

  uint8_t res12[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UCV:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_UCV_REG;

  uint8_t res13[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t CTR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART_CTR_REG;

};

#define UART (*(volatile struct UART_tag *) 0x50001000)

struct UART2_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t RBR_THR_DLL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_RBR_THR_DLL_REG;

  uint8_t res0[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t ERBFI_dlh0:1;
      uint64_t ETBEI_dlh1:1;
      uint64_t ELSI_dhl2:1;
      uint64_t reservedSpace0:4;
      uint64_t PTIME_dlh7:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_IER_DLH_REG;

  uint8_t res1[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t IIR_FCR:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_IIR_FCR_REG;

  uint8_t res2[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_DLS:2;
      uint64_t UART_STOP:1;
      uint64_t UART_PEN:1;
      uint64_t UART_EPS:1;
      uint64_t reservedSpace0:1;
      uint64_t UART_BC:1;
      uint64_t UART_DLAB:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_LCR_REG;

  uint8_t res3[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t reservedSpace0:1;
      uint64_t UART_RTS:1;
      uint64_t UART_OUT1:1;
      uint64_t UART_OUT2:1;
      uint64_t UART_LB:1;
      uint64_t UART_AFCE:1;
      uint64_t UART_SIRE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_MCR_REG;

  uint8_t res4[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_DR:1;
      uint64_t UART_OE:1;
      uint64_t UART_PE:1;
      uint64_t UART_FE:1;
      uint64_t UART_BI:1;
      uint64_t UART_THRE:1;
      uint64_t UART_TEMT:1;
      uint64_t UART_RFE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_LSR_REG;

  uint8_t res5[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_DCTS:1;
      uint64_t reservedSpace0:3;
      uint64_t UART_CTS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_MSR_REG;

  uint8_t res6[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t UART_SCRATCH_PAD:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SCR_REG;

  uint8_t res7[18];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR0_REG;

  uint8_t res8[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR1_REG;

  uint8_t res9[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR2_REG;

  uint8_t res10[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR3_REG;

  uint8_t res11[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR4_REG;

  uint8_t res12[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR5_REG;

  uint8_t res13[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR6_REG;

  uint8_t res14[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR7_REG;

  uint8_t res15[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR8_REG;

  uint8_t res16[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR9_REG;

  uint8_t res17[2];

  union
  {
    uint16_t R;
    struct
    {
      uint64_t SRBR_STHRx:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) UART2_SRBR_STHR10_REG;

