iSYSTEMLabs/winIDEAExampleWorkspaces/DialogSemiconductor/DA14681/targetInit/DA14681_sfr.h
};

#define USB (*(volatile struct USB_tag *) 0x50001800)

struct WAKEUP_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_DEB_VALUE:6;
      uint64_t WKUP_SFT_KEYHIT:1;
      uint64_t WKUP_ENABLE_IRQ:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_CTRL_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t COMPARE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_COMPARE_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_IRQ_RST:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_RESET_IRQ_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t EVENT_VALUE:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_COUNTER_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_CNTR_RST:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_RESET_CNTR_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_SELECT_P0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_SELECT_P0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_SELECT_P1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_SELECT_P1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_SELECT_P2:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_SELECT_P2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_SELECT_P3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_SELECT_P3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_SELECT_P4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_SELECT_P4_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_POL_P0:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_POL_P0_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_POL_P1:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_POL_P1_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_POL_P2:5;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_POL_P2_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_POL_P3:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_POL_P3_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t WKUP_POL_P4:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WKUP_POL_P4_REG;

};

#define WAKEUP (*(volatile struct WAKEUP_tag *) 0x50000100)

struct WDOG_tag
{
  union
  {
    uint16_t R;
    struct
    {
      uint64_t WDOG_VAL:8;
      uint64_t WDOG_VAL_NEG:1;
      uint64_t WDOG_WEN:7;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WATCHDOG_REG;

  union
  {
    uint16_t R;
    struct
    {
      uint64_t NMI_RST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(2))) WATCHDOG_CTRL_REG;

};

#define WDOG (*(volatile struct WDOG_tag *) 0x50003100)

